init:

    $ mods["hfhfhrf_1"]=u"qawseffr"
    $ sd = Character (u'Данил', color="#FFAA28", what_color="E2C778")
    $ vl = Character (u'Влад', color="#0000FF", what_color="E2C778")
    $ ar = Character (u'Арсений', color="#0000FF", what_color="#2f853e")
    $ ap = Character (u'Пришелец', color="#0000FF", what_color="#648a6b") # Арсений
    $ bp = Character (u'Пришелец', color="#0000FF", what_color="#648a6b") # Влад

    $ us_ochki = 0
    $ sl_ochki = 0
    $ un_ochki = 0
    $ dv_ochki = 0
    $ mi_ochki = 0
    $ uv_ochki = 0
    
    $ persistent.sprite_time = 'day'
    





    
##                                                                        ░░███╗░░
##                                                                        ░████║░░
##                                                                        ██╔██║░░
##                                                                        ╚═╝██║░░
##                                                                        ███████╗
##                                                                        ╚══════╝








label hfhfhrf_1:
    play music music_list["a_promise_from_distant_days"]
    th"И снова этот лагерь..."
    th"Может в этот раз повезёт?"
    th"Интересно, а кто-то ещё до меня попадал сюда в 'Совёнок'?"
    th"Может я избранный?"
    th"Или мне просто повезло.."
    th"Из огромного количества людей позвело именно мне..."
    th"Сесть из неоткуда взявшийся 410-ый Икарус и оказатся в другом мире."
    th"Что я такого сделал?"
    th"Может я кому-то переступил дорогу?"
    th"В прочем это уже не важно..."
    th"Я уже здесь..."
    th"Ну, пора просыпатся"
    stop music
    show int_bus
    th"Я вышел из автобуса."
    play ambience ambience_camp_entrance_day
    hide int_bus
    show ext_camp_entrance_day
    th"Проходя мимо знакомых мне статуй-пионеров стоящих возле ворот в 'Совёнок' я в шутку с ними поздаровался."
    th"Привет, Андрей!"
    th"Здарова, Никита!"
    th"Я здесь уже настолько часто, что дал статуям имена."
    th"Вдруг в стороне ворот послышался странный звук."
    th"Я посмотрел на ворота."
    show sl surprise pioneer at right with dissolve
    th"И увидел недоумённое лицо Слави."
    th"На её лице читалось \"что ты делаешь?\""
    sd"Привет..."
    th"Сказал я спустя несколько секунд."
    th"Славя ответила мне не сразу."
    show sl normal pioneer at right with dissolve     
    sl"П..Привет."
    sd"Ты не думай ничего такого..."
    sd"Я просто люблю общатся с предметами..."
    th"Только щас я понял насколько глупую вещь я сморозил..."
    show sl smile pioneer at right with dissolve
    "Славя улыбнулась"
    sd"Ладно, тогда я пойду?"
    sl"А ты знаешь дорогу до вожатой?"
    sd"Да, я тут уже не первый год отдыхаю"
    play sound sfx_carousel_squeak
    th"Я направился в лагерь."
    scene bg ext_clubs_day with dissolve
    th"Проходя мимо кружков, я надеялся увидеть ситуацию Лены с Ульяной."
    th"Но их нигде не было."
    sd"Может это из-за того что я так быстро зашёл в лагерь?"
    th"Ну ладно."
    th"Вообще я никогда не заострял внимание на этой сцене."
    th"Видимо соскучился..."
    th"Потом я направился на площадь."
    scene bg ext_square_day with dissolve
    th"Где стоял уже знакомый мне Генда."
    th"Я так и не понял чем он прославился..."
    play music music_list["always_ready"]
    th"Подойдя ближе к статуе Генды я увидел Алису."
    th"Она что-то писала."
    sd"Опять что-то чудит"
    th"Я решил не идти с ней на контакт..."
    th"Сразу..."
    stop music 
    th"Я направился к домику Ольги Дмитриевны."
    scene ext_houses_day with dissolve
    th"Блин, он стал мне уже как родной..."
    th"Как и все обитатели этого лагеря..."
    th"Когда я почти подошёл к домику Ольги Дмитриевны я увидел Ульяну."
    show us smile sport at center with dissolve
    th"Она за кем-то следила."
    sd"Видимо готовят какой-то розыгрыш вместе с Алисой"
    th"Эта парочка держит весь лагерь в страхе..."
    th"Не дай бог переступить им дорогу..."
    th"Подойдя ближе к Ульяне, я увидел за кем идёт слежка."
    scene ext_washstand_day with dissolve
    th"Увидев Женю подходящую к умывальникам."
    show mz bukal glasses pioneer at center with dissolve
    th"Посмотрев на умывальники, я увидел наверху крыши ведро к которому привязана верёвка начало которого у Ульяны в руке."
    th"В ведре виднелась какая-то коричневая жижа."
    th"То ли это грязь либо...."
    "Фу-у-у"
    th"Даже не хочу об этом думать..."
    th"Я развернулся и пошёл к домику Ольги Дмитриевны."
    scene ext_house_of_mt_day with dissolve
    th"Зайдя внутрь, я увидел саму Ольгу Дмитриевну сидящую за столом."
    show mt normal pioneer at center with dissolve
    th"Она писала какие-то бумажки."
    th"Видимо она не услышала как я вошёл."
    th"Я поздаровался с ней."
    sd"Здравствуйте!"
    th"Ольга Дмитриевна испугалась."
    show mt surprise pioneer  at center with dissolve
    mt"Тебя стучатся не учили!?"
    show mt angry pioneer at center with dissolve
    th"Крикнула она."
    sd"Извините..."
    th"Сказал я дрожащим голосом."
    th"Первое знакомство видимо не удалось..."
    show mt normal pioneer at center with dissolve
    mt"Ну ладно, заходи."
    th"Я сразу подошёл к кровати, сбросил вещи и взял мои пионерские со шкафа."
    th"Ольга Дмитриевна смотрела на меня глазами по пять копеек."
    show mt surprise pioneer  at center with dissolve
    th"И тут я понял..."
    th"За всё время прибывания в лагере я не видел здешних денег..."
    th"Совсем..."
    th"Не ужели тут всё за даром?"
    th"Или может это ещё одна тайна, которую от меня прячут."
    th"Узнав которую я разоблачу причину своего прибывания здесь.."
    th"Хотя вряд-ли из-за пяти копеек я узнаю столько всего. "
    th"И тут в реальность меня вернула Ольга Дмитриевна."
    show mt angry pioneer at center with dissolve
    mt"Ты что себе позволяешь?!?"
    mt"Вламываешся в домик, раскидываешся вещами!"
    mt"Разве так себя видёт настоящий пионер?!"
    mt"Да и на пионера ты не похож!"
    th"Блин...Это же первый день.."
    th"Как я мог забыть..."
    sd"Извините, пожалуйста. Меня Данил зовут!"
    show mt normal pioneer at center with dissolve
    mt"Данил, значит..."
    mt"Данил, ты почему себя ведёшь как бандит какой-то?"
    mt"Ты же хочешь стать пионером?"     
    "Я им стал уже почти месяц назад..."
    sd"Конечно, хочу. Извините меня пожалуйста. Больше не повторится."
    th"Сказал я провинившимся голосом."
    mt"Хорошо Данил. Меня зовут Ольга Дмитриевна и я вожатая этого пионер-лагеря."
    show mt smile pioneer at center with dissolve
    th"Будем считать, что я этого не знал."
    sd"Хорошо Ольга Дмитриевна, можно я пойду?"
    th"Мне надо бы поскорее ускользнуть."
    mt"Ну завтрак и линейку ты уже пропустил, так что можешь идти."
    th"Наконец-то"
    th"Я развернулся и направился в сторону выхода."
    hide mt smile pioneer
    th"Как тут меня опять окликнула Ольга Дмитриевна."
    show mt normal pioneer at center with dissolve
    mt"Данил."
    mt"А откуда ты знаешь где лежали запасная одежда для пионера?"
    th"~Вот это я встрял..~"
    th"Надо думать логически!"
    sd"А...Я..."
    th"Думай! ДУМАЙ!"
    sd"Я просто..."
    th"И тут раздался громкий вопль!"
    play music music_list["doomed_to_be_defeated"]
    th"Где-то с улицы!"
    th"Видимо ловушка Ульяны сработала!"
    th"Ольга Дмитриевна кинулась из домика, чтобы посмотреть причину таких ужасно громких звуков."
    hide mt normal pioneer
    th"Я вышел следом."
    scene ext_house_of_mt_day with dissolve
    th"Там стояла Женя.."
    th"Но почему-то..."
    th"Чистая?"
    th"Значит где-то Ульяна прокололась..."
    stop music 
    play music music_list["feeling_good"]
    th"Придумывать ловушки - это одно дело..."
    th"А вот сделать так чтобы она сработала в нужном месте, в нужном времени..."
    th"До такого ей ещё далеко."
    th"Из монолога меня выдернули крики Ольги Дмитриевны на провинившуюся Ульяну."
    th"А рядом стояла лишь слегка запачканая Женя, сложившая руки и наблюдавшая за громким отчётом Ульянки.."
    th"Она там ещё не оглохла?"
    th"Ведь и вправду.."
    th"Стоя в 10-20 метрах от разгневанной Ольги Дмитриевны мне было всё очень хорошо слышно."
    th"ОЧЕНЬ!"
    th"Наверное стоять вблизи от взрыва и не оглохнуть.."
    th"Задача непростая..."
    th"Постояв там меньше 10 секунд, я захотел по быстрее уйти."
    th"Думаю не надо объяснять почему."
    th"Думаю стоит пойти на пляж."
    th"Но плавки находятся в домике Ольги Дмитриевны"
    th"Точно!"
    th"Её сейчас лучше не беспокоить.."
    th"Поэтому обойдёмся без пляжа.."
    th"Может стоить проверить Электроника и Шурика?"
    "ВОТ! Хорошая идея!"
    "Я что, начинаю разговаривать сам с собой?"
    "Да ну!"
    "И я про тоже!"
    th"Я направился к зданию кружков."
    scene ext_square_day with dissolve
    th"Проходя мимо Генды, на площади, я увидел Славю."
    th"Она что-то искала в траве.."
    th"Не буду ей мешать"
    th"Пройдя мимо Слави я покинул площадь"
    scene ext_clubs_day with dissolve
    th"И уже стоял перед зданием кружков."
    th"После кибернетиков можно будет зайти к длинноволосой."
    play sound sfx_open_dooor_campus_1
    scene int_clubs_male_day with dissolve
    th"Я зашёл внутрь."
    th"Но там никого не было."
    th"Пока я шёл от домика Ольги Дмитриевны до здания кружков, я их не наблюдал"
    th"Я вошёл в кружок музыки."
    th"Но Мику там не было.."
    th"Да чтож такое!"
    th"Хорошо..Куда можно отправится?"
    th"Может..."
    th"Я поудмал о спортивной площадке."
    th"Но ведь сейчас жара."
    th"Лучше вечером..."
    th"Либо никогда."
    th"Я любил заниматся спортом."
    th"Но не в жару +30"
    th"Надо пойти умыться"
    th"И с мыслями о приятной лединящей, освежительной воде из умывальника."
    th"В такую жару ледяная вода станет...Чутка теплее."
    th"Подходя к умывальникам я вспомнил свою первую встречу с водой из антарктиды."
    th"Даже холодно вспоминать."
    scene ext_washstand_day with dissolve
    th"Ту ду Тыщ.."
    th"Я вытянул пальцы и сделал жест, будто играю на барабанах."
    th"Выкрутив крутилку возле крана, я набрал в руки воды."
    scene ext_washstand2_day
    th"По ощущениям она не отличалась от первого раза."
    th"Видимо мой прогноз не сработал."
    th"Но от такой жары как-то надо спасатся."
    th"Я закрыл глаза и плеснул воду в лицо."
    play sound sfx_water_splash
    th"А-а-а-а!!"
    th"Освежающе."
    "Хорошо!"
    th"Вода была просто не выносимо холодной."
    th"Но жара согревала её до состояния...холодной."
    th"Сзади кто-то подошёл и дёрнул меня за плечо."
    th"Я обернулся и увидел там Электроника."
    show el laugh pioneer at center with dissolve
    el"Привет! С тобой всё хорошо?"
    th"От того что я слишком сильно закрыл глаза, моё лицо было красным."
    sd"Да, да..."
    el"Тебе лицо не морозит?"
    "С насмешкой спросил меня Электроник."
    sd"Есть чутка."
    "Ответил я дрожащим голосом."
    el"Меня Электроником зовут."
    th"Да да..."
    sd"Меня Данил."
    th"Мы пожали руки."
    th"И вовремя нашего дружеского рукопожатия прозвенел звонок на обед."
    play sound sfx_dinner_horn_processed
    show el smile pioneer at center with dissolve
    el"Пойдёшь?"
    sd"Конечно."
    th"И вместе с Электроником мы отправились в столовую."
    th"Подойдя к столовой, я увидел привычную мне..."
    scene ext_dining_hall_away_day with dissolve
    th"Да и этому месту толпу пионеров, пихавшись возле входа."
    th"Ольга Дмитриевна, которая пытается успокоить толпу голодных детей."
    th"Всё это казалось уже обыденным, слишком обыденным."
    th"И всё же, Ольга Дмитриевна впустила толпу оголодавших зверей."
    th"Мы вошли следом."
    scene int_dining_hall_people_day
    th"Когда мы вошли в столовую, детей было слишком много."
    th"Электроник попрощался и сел за столик к Шурику."
    th"А я остался в скитании по столовой в надежде найти свободное место."
    th"Через минуту безмятежной хотьбы по клетчатому полу, меня позвала Ольга Дмитриевна."
    show mt normal pioneer at center with dissolve
    mt"Данил, ты чего бродишь?"
    sd"Место не могу найти..."
    mt"Пошли поищем."
    th"Она взяла меня за руку и потащила обсматривать столы."
    th"В итоге место нашлось."
    th"Рядом с Алисой и недавно провинившейся Ульянкой."
    mt"Вот смотри."
    sd"Да, хорошо,Спасибо."
    th"Присев на стул, я смотрел на Алису."
    show dv smile at left with dissolve
    show us smile at right with dissolve
    th"Ох...Она прекрасна.."
    dv"Чего пялишся?"
    show dv grin  pioneer2 at left with dissolve
    "Я резко опустил голову в тарелку."
    dv"На сиськи или на лицо?"
    show dv laugh pioneer2 at left with dissolve
    show us laugh sport at right with dissolve
    th"Ульянка закрыв рот начала хихикать."
    dv"Чего молчишь? Стыдно стало?"
    "Я заметно покраснел."
    us"Или влюбился?"
    th"Вот тут я был шокирован."
    th"Она меня видит несколько минут, а уже такие глаголы про меня говорит."
    dv"Тебя хоть как зовут?"
menu:                    
        "Сказать имя":
            $ us_ochki += 1
            jump hfhfhrf_2
            
        "Ничего не говорить":
            $ us_ocki = 0
            jump hfhfhrf_3
label hfhfhrf_2:
    sd"Данил меня звать.А вас девчата как?"
    th"Они явно не ожидали такого дерзкого и резкого ответа."
    show dv suprise pioneer2 at left with dissolve
    dv"А..А меня Алиса."
    us"Меня Ульяна."
    th"Добавила Ульяна."
    sd"Ладно, я пойду."
    th"Сказал я увернно и без единого промаха."
    dv"Иди,иди."
    th"Я поставил тарелку и вышел из столовой."
jump hfhfhrf_4
label hfhfhrf_3:
show dv laugh pioneer2 at left with dissolve
show us laugh sport at right with dissolve
    us"Может он немой или глухой?"
    th"Так как это было слишком резко я не знал что им и ответить.."
    th"Ульяна начала мне что-то показывать пальцами.."
    th"Думая что я глухой."
    us"Скучный ты какой-то..."
    sd"Данил меня зовут."
    th"Сказал я дрожащим голосом."
    dv"Наконец-то!"
    th"Я быстро доел, и направился к выходу."
    label hfhfhrf_4:
    scene ext_dining_hall_near_day with dissolve
    th"Выйдя из столовой, я решил направится к кружкам и снова попытать удачу."
    th"Только на этот раз я зашёл сразу зайти к нашему музыканту."
    th"Или музыкантке..."
    th"Ну вообщем суть понята."
    scene ext_musclub_day
    play sound sfx_drawer_rattle
    th"Подойдя к зданию кружков, я инстинктивно хотел открыть дверь, но врезался, так как она была закрыта."
    th"Ну значится на второй день..."
    th"Далее я решил пойти на пляж."
    th"Так как теперь нет особых проблем взять плавки у Ольги Дмитриевны."
    th"Именно так мы и поступим!"
    th"С такой позитивной нотой я направился к Ольге Дмитриевне."
    scene ext_house_of_mt_day with dissolve
    th"Стоя возле порога в домик Ольги Дмитриевны, я обязательно"
    play sound sfx_knock_door7_polite
    th"ПОСТУЧАЛСЯ!"
    th"После чего вошёл."
    scene int_house_of_mt_day
    th"Но в домике никого не было.."
    th"Блин, не показал Ольге Дмитриевне свою воспитанность."
    th"Взяв плавки из шкафа, я переоделся и пошёл на пляж."
    scene ext_beach_day
    th"На пляжу никого не было."
    th"Меньше народу-больше кислороду!"
    th"Окунув палец в воду я убедился что она была тёплой."
    th"По-крайней мере теплее воды из умывальников."
    th"На пару тысяч градусов."
    th"Оставив вещи на песке..."
    th"Я со спокойной душой вошёл в воду."
    play sound sfx_water_emerge
    th"Зайдя в воду все мысли как будто смыло."
    th"Я зашёл подальше на глубину."
    th"Чтобы просто лечь пластом на воде."
    th"Закрыть глаза.."
    show blink 
    th"И просто помечтать.."
    th"О себе..."
    th"О моей жизни..."
    th"О том как попал сюда..."
    th"О этом лагере..."
    th"О его обитателях..."
    th"О Алисе..."
    th"О Алисе..."
    th"Мои мысли расплывались у меня в голове..."
    th"Будто я сейчас лежу в облаках..."
    th"И меня совершенно не заботит то, что происходит тут.."
    th"На земле."
    th"Какие-же мы ничтожно мелкие."
    th"От сюда все проблемы кажутся такими лёгкими."
    th"Будто я могу их сдуть..."
    th"Так.."
    th"Фу-у-ух"
    th"И всё..."
    th"Я дома.."
    th"Пью либимый чай..."
    th"Смотрю видео..."
    th"И поедаю печеньки..."
    th"Меня отвлекла попавшая в нос вода."
    th"Открыв глаза, я увидел что уже ночь."
    show blink
    scene ext_beach_night
    th"НОЧЬ!?!"
    th"Сколько я спа...ПЛАВАЛ??"
    th"Я брасом поплыл до берега."
    th"Начал бегать по берегу в надежде найти мои вещи."
    th"Но, там где я их остовлял вещей не было..."
    th"Ну конечно, мог бы догадатся..."
    th"Слишком банально."
    th"Надо было спешить."
    scene ext_square_night with dissolve
    th"Я напролом побежал через площадь в домик Ольги Дмитриевны."
    th"Хорошо что была ночь и на улице никого не было."
    scene ext_house_of_mt_night_without_light
    th"Стоя на пороге в домик Ольги Дмитриевны, я глубоко вздохнул."
    th"Придумал заренее отговорку на вопросы..."
    th"Где ты был?"
    th"Почему так поздно?"
    th"Почему ты в плавках?"
    th"Отлично"
    th"И сполной уверенностью в своих отговорках открыл дверь."
    th"Как не странно, но Ольга Дмитриевна уже спала."
    th"Но вот остался только один вопрос."
    th"Что с одеждой делать?"
    th"Так как я знал что это 100 были девчонки."
    th"Надо наведатся к ним."
    th"Посмотрев на часы, я увидел время"
    "22:00"
    th"Интересно, почему Ольга Дмитриевна не похватилась меня искать?"
    th"Может ей плевать что у неё стало на одного пионера меньше."
    th"Так ещё и того, который живёт с ней в ОДНОМ ДОМИКЕ!!!"
    th"Но сейчас не об этом."
    th"Девочки сейчас по-любому спали."
    th"Я направился к ним в домик."
    th"Так что я стоял возле двери в домик девочек."
    th"В голове крутилась одна мысль"
    th"Будь открыт!"
    "Я дёрнул ручку двери."
    th"И..."
    th"Она была..."
    th"Закрыта."
    th"Ну хоть на что-то они способны, кроме их дебильных шуток."
    th"Я решил обойти дом, в надежде увидеть там открытую форточку."
    th"На улице было жарко, так что почему бы и нет."
    th"Судьба оказалась благородна ко мне, ведь форточка была открыта."
    th"Прям как в каких-нибудь фильмах про шпионов."
    th"Положив руки на раму, я опёрся и..."
    th"Застрял."
    th"Чёрт!"
    th "Зачем делать такие узкие форточки?"
    th"Производители привидели пионера в мокрых плавках, который пытается проникнуть в домик к девочкам."
    th"Как какой-то извращенец."
    th"А ОНИ ФЕТИШИСТКИ!!!"
    th"РАЗ УЖЕ ВЕЩИ БЕРУТ!"
    th"Просунув руки сквозь форточку, я поставил ноги на стол."
    th"И благополучно проник в домик к девочкам."
    th"Надо менее извращентски формулировать мысли."
    th"Свет включить я не мог."
    th"По понятным причинам."
    th"Так что пытался нащупать свои вещи."
    th"Хотя..."
    th"Вспомнив, что глаз имеет процесс темновой адаптации."
    th"Это когда глаз через некоторое время может привыкнуть к темноте."
    th"Я стоял не подвижно."
    th"И я не знал сколько мне надо было так стоять."
    th"Но времени у меня много."
    th"Хотя про болезни девчонок я не знал."
    th"Может они лунатят?"
    th"Или кто-то захочет по среди ночи попить воды."
    th"Или сходить в туалет."
    th"А тут я.."
    "Как же они испугаются."
    th"Я хихикнул."
    th"Через минут 6, я уже начал что-то различать в темноте."
    th"Но сзади послышался скрип кровати."
    th"Я обернулся."
    th"В моей голове было куча мыслей."
    th"Если они меня увидят, то что подумают?"
    th"Извращенец, Маньяк, Педофил?"
    th"Или они сначало завезжат?"
    th"Обернувшись, я увидел Алису."
    th"Которая переворачивалась в кровати."
    th"Аа-а-а-а-а!!"
    th"Прокричал я про себя."
    th"К этому времени я начал уже видеть в темноте."
    th"Более менее."
    th"Этого хватало чтобы различить мои вещи."
    th"Я увидел что, вещи весят на спинках кровати Алисы и Ульяны."
    th"В знак отомщения, я взял их вещи со спинки кровати и выбросил в окно."
    th"Позже спрячу."
    th"Но в чём тогда они спят?"
    th"Вот такая шедевральная мысль мне пришла, находясь в закрытом домике двух спящих, ничего не подозревающих девочек."
    th"Одной из которых даже нету 18..."
    th"По моим данным."
    th"Так! Не отвлекатся."
    th"Разумно было предположить, что вещи на спинках кровати- это вещи девчонок."
    th"Но моих вещей не наблюдалось..."
    th"Может в шкафу?"
    th"Подойдя к шкафу, я взялся за дверцу."
    th"Она предательски скрипнула..."
    th"Сука!"
    th"Моё сердце билось настолько сильно, что стуки были громче самого скрипа."
    th"Оккуртно открыв дверь, там были только купальники и другие вещи."
    th"Но не мои..."
    th"Может под кроватью?"
    th"Нагнувшись под кровать Алисы, я увидел там только пионерскую обувь."
    th"Под кроватью Ульяны было тоже самое."
    th"Тогда.."
    th"ГДЕ МОИ ВЕЩИ?!?~"
    th"Вот тут я не на шутку испугался."
    th"Так..Спокойствие.."
    th"Я остался запертым в домике с двумя девочками, которые увидев меня, испортят мне ВЕСЬ ОСТАВШИЙСЯ ЦИКЛ."
    th"Просто надо оккуратно свалить."
    th"Я решил что можно выйти либо так, как я пришёл, но это очень рискованно."
    th"Либо найти ключ и выйти как обычно, но потом закрыть дверь и подбросить ключ."
menu:
    "Вылезти через форточку":
        $ us_ocki = 0
        jump hfhfhrf_5
    "Выйти через дверь":
        $ us_ochki +=1
        jump hfhfhrf_6
     
label hfhfhrf_5:
    th"Была не была"
    th"Я попытался оккуратно залесть на стол."
    th"Но он шатался."
    th"Почему я этого не подметил когда взберался сюда впервые?"
    th"Вместе со столом шатался и я, когда стал на него двумя ногами."
    th"Больше всего я боялся что он сломается."
    th"Взявшись за оконную раму, я просунул туда руки и вылез из домика."
    th"Но..Упал на траву."
    th"Конечно, было больно, но сейчас было не до этого."
    th"Увидев на земле вещи девочек, я решил всё же вернуть их."
    th"Чтобы завтра они не навели шороху."
    th"Но положить обратно на спинку кровати я их уже не смогу."
    th"Поэтому я выбрал вариант просто."
    th"Докинуть."
    th"Разделив где-чьи вещи, я с розмаху пытался кинуть на кровать"
    th"Но в итоге они просто разлетелись по комнате..."
    th"Ладно, сейчас не об этом."
    th"Я развернулся и пошёл в домик Ольги Дмитриевны."
jump hfhfhrf_7
label hfhfhrf_6:
    th"Думаю более логичным будет, найти ключ и просто выйти отсюда."
    th"Только где его искать?"
    th"Хорошо, я с ними не первый цикл."
    th"Если хорошо вспомнить, то..."
    "Данил закрывает глаза и мимо пролетают мнгновения с Алисой."
    th"И почему я не рассматривал комнату?"
    th"Если логически подумать?"
    th"На столике?"
    th"а столике!"
    th"И к моему удивлению, он находился именно там."
    th"Я взял ключ, отомкнул дверь и просто вышел."
    th"Не забыв запереть за собой дверь."
    th"Обойдя дом, чтобы закинуть ключ обратно, на глаза мне попалась их одежда."
    th"Пусть лежит."
    th"Будет им уроком."
    th"Закинув ключ, а он упал довольно громко, я направился к домику Ольги Дмитриевны."
label hfhfhrf_7:
    th"По пути я размышлял."
    th"Кто мог взять мои вещи?"
    th"Может я зря с ними так поступил?"
    th"Но больше меня волновал первый вопрос."
    th"Ведь кроме них двоих шутников у нас нету."
    th"Зайдя в домик Ольги Дмитриевны, я думал что она мне скажет завтра и будет ли она меня пытать?"
    th"Накрывшись одеялом, я вздохнул и скоро заснул."





 
  
##                                                                                                    ██████╗░
##                                                                                                    ╚════██╗
##                                                                                                    ░░███╔═╝
##                                                                                                    ██╔══╝░░
##                                                                                                    ███████╗
##                                                                                                    ╚══════╝







uegibewaiugb