init:
    $ mods["Mods_Arseny_Danil_Vlad_Artem_day_1_1"]=u"MA2"


    $ sd = Character (u'Данил', color="#FFAA28", what_color="E2C778")
    $ vl = Character (u'Влад', color="#5181fc", what_color="E2C778")
    $ ar = Character (u'Арсений', color="#4fee62", what_color="E2C778")
    $ ap = Character (u'Пришелец', color="#4fee62", what_color="E2C778") #- Арсений
    $ bp = Character (u'Пришелец', color="#5181fc", what_color="E2C778") #- Влад
    $ ss = Character (u'Система', color="#ffb3b3", what_color="FFB3B3")
    $ vlar = Character (u'Влад и Арсений', color="#50B8AF", what_color="FFB3B3")


    $ us_ochki = 0
    $ un_ochki = 0
    $ sl_ochki = 0
    $ dv_ochki = 0
    $ mi_ochki = 0
    $ uv_ochki = 0

    $ day_1_is_exit_door = 0
    $ is_hodil_brodil = 0
    
    $ daylock = "false"

    image int_house_of_dv_night2 = "mods/Mods_A_D_V_A/img/int_house_of_dv_night2.jpg"
    image d2_mt_undressed_me = "mods/Mods_A_D_V_A/img/d2_mt_undressed_me.jpg"
    image d2_mt_undressed_2_me = "mods/Mods_A_D_V_A/img/d2_mt_undressed_2_me.jpg"
    image ext_stage_normal_sunset = "mods/Mods_A_D_V_A/img/ext_stage_normal_sunset.png"

    $ KinoBezdelnik = "mods/Mods_A_D_V_A/music/KinoBezdelnik.mp3"
    $ Zvezda = "mods/Mods_A_D_V_A/music/Zvezda.mp3"
    $ volnyuch = "mods/Mods_A_D_V_A/music/volnyuch.mp3"

    image vl angry = "mods/Mods_A_D_V_A/img/boy a_casual_angry.png"
    image vl confused = "mods/Mods_A_D_V_A/img/boy a_casual_confused.png"
    image vl cry = "mods/Mods_A_D_V_A/img/boy a_casual_cry.png"
    image vl flustered = "mods/Mods_A_D_V_A/img/boy a_casual_flustered.png"
    image vl happy = "mods/Mods_A_D_V_A/img/boy a_casual_happy.png"
    image vl nervous = "mods/Mods_A_D_V_A/img/boy a_casual_nervous.png"
    image vl normal = "mods/Mods_A_D_V_A/img/boy a_casual_normal.png"
    image vl sad = "mods/Mods_A_D_V_A/img/boy a_casual_sad.png"
    image vl shocked = "mods/Mods_A_D_V_A/img/boy a_casual_shocked.png"

    image ar angry = "mods/Mods_A_D_V_A/img/e1-angry.png"
    image ar maybe = "mods/Mods_A_D_V_A/img/e1-maybe-not.png"
    image ar normal = "mods/Mods_A_D_V_A/img/e1-normal.png"
    image ar oops = "mods/Mods_A_D_V_A/img/e1-oops.png"
    image ar smile = "mods/Mods_A_D_V_A/img/e1-smile.png"
    image ar smile2 = "mods/Mods_A_D_V_A/img/e1-smile2.png"
    image ar surprised = "mods/Mods_A_D_V_A/img/e1-surprised.png"
    image ar tsundere = "mods/Mods_A_D_V_A/img/e1-tsundere.png"

    image ar siluet = "mods/Mods_A_D_V_A/img/e1-smile_siluet.png"
    image vl siluet = "mods/Mods_A_D_V_A/img/boy a_casual_normal_siluet.png"









#                                                                            ░░███╗░░
#                                                                            ░████║░░
#                                                                            ██╔██║░░
#                                                                            ╚═╝██║░░
#                                                                            ███████╗
#                                                                            ╚══════╝








    
label Mods_Arseny_Danil_Vlad_Artem_day_1_1:
    play music music_list["a_promise_from_distant_days"] fadeout 2
    $ day_time()
    $ persistent.sprite_time = "day" 
    th"И снова этот лагерь..."
    th"Может в этот раз повезёт?"
    th"Интересно, а кто-то ещё до меня попадал сюда в 'Совёнок'?"
    th"Может я избранный?"
    th"Или мне просто повезло.."
    th"Из огромного количества людей позвело именно мне..."
    th"Сесть из неоткуда взявшийся 410-ый Икарус и оказатся в другом мире."
    th"Что я такого сделал?"
    th"Может я кому-то переступил дорогу?"
    th"В прочем это уже не важно..."
    th"Я уже здесь..."
    th"Ну, пора просыпатся"
    scene int_bus
    show unblink
    "..."
    hide unblink
    th"Я опять в совёнке?"
    th"Я вышел из автобуса."
    stop music fadeout 3
    play ambience ambience_camp_entrance_day fadeout 3
    hide int_bus with dissolve
    show ext_camp_entrance_day with dissolve
    "Проходя мимо знакомых мне статуй-пионеров стоящих возле ворот в 'Совёнок' я в шутку с ними поздаровался."
    sd"Привет, Андрей!"
    sd"Здарова, Никита!"
    th"Я здесь уже настолько часто, что дал статуям имена."
    "Вдруг в стороне ворот послышался странный звук."
    "Я посмотрел на ворота."
    show sl surprise pioneer at right with dissolve
    "И увидел недоумённое лицо Слави."
    "На её лице читалось \"что ты делаешь?\""
    sd"Привет..."
    "Сказал я спустя несколько секунд."
    "Славя ответила мне не сразу."
    show sl normal pioneer at right with dissolve     
    sl"П..Привет."
    sd"Ты не думай ничего такого..."
    sd"Я просто люблю общатся с предметами..."
    "Только щас я понял насколько глупую вещь я сморозил..."
    show sl smile pioneer at right with dspr
    "Славя улыбнулась"
    sd"Ладно, тогда я пойду?"
    sl"А ты знаешь дорогу до вожатой?"
    sd"Да, я тут уже не первый год отдыхаю"
    "Я направился в лагерь."
    play sound sfx_carousel_squeak fadeout 2
    scene bg ext_clubs_day with dissolve
    "Проходя мимо кружков, я надеялся увидеть ситуацию Лены с Ульяной."
    "Но их нигде не было."
    sd"Может это из-за того что я так быстро зашёл в лагерь?"
    th"Ну ладно."
    "Вообще я никогда не заострял внимание на этой сцене."
    "Видимо соскучился..."
    "Потом я направился на площадь."
    scene bg ext_square_day with dissolve
    "Где стоял уже знакомый мне Генда."
    "Я так и не понял чем он прославился..."
    play music music_list["always_ready"] fadeout 2
    "Подойдя ближе к статуе Генды я увидел Алису."
    "Она что-то писала."
    sd"Опять что-то чудит"
    "Я решил не идти с ней на контакт..."
    th"Сразу..."
    "Я направился к домику Ольги Дмитриевны."
    stop music fadeout 3
    play music music_list["eat_some_trouble"] fadeout 3
    scene ext_houses_day with dissolve
    th"Блин, он стал мне уже как родной..."
    th"Как и все обитатели этого лагеря..."
    "Когда я почти подошёл к домику Ольги Дмитриевны я увидел Ульяну."
    show us smile sport at center with dissolve
    "Она за кем-то следила."
    "Видимо готовят какой-то розыгрыш вместе с Алисой"
    th"Эта парочка держит весь лагерь в страхе..."
    th"Не дай бог переступить им дорогу..."
    "Подойдя ближе к Ульяне, я увидел за кем идёт слежка."
    scene ext_washstand_day with dissolve
    th"Женя идущая к умывальникам."
    show mz bukal glasses pioneer at center with dissolve
    "Посмотрев на умывальники, я увидел наверху крыши ведро к которому привязана верёвка начало которого у Ульяны в руке."
    "В ведре виднелась какая-то коричневая жижа."
    th"То ли это грязь либо...."
    th"Фу-у-у"
    th"Даже не хочу об этом думать..."
    scene ext_house_of_mt_day with dissolve
    "Я развернулся и пошёл к домику Ольги Дмитриевны."
    scene int_house_of_mt_day with dissolve
    play sound sfx_open_journal
    stop ambience fadeout 2
    "Зайдя внутрь, я увидел саму Ольгу Дмитриевну сидящую за столом."
    play sound sfx_medpunkt_door_open
    show mt normal pioneer at right with dissolve
    "Она писала какие-то бумажки."
    "Видимо она не услышала как я вошёл."
    "Я поздаровался с ней."
    sd"Здравствуйте!"
    show mt surprise pioneer  at center with dspr
    "Ольга Дмитриевна испугалась."
    show mt angry pioneer at center with dspr
    mt"Тебя стучатся не учили!?"
    "Крикнула она."
    sd"Извините..."
    "Сказал я дрожащим голосом."
    th"Первое знакомство видимо не удалось..."
    show mt normal pioneer at center with dspr
    mt"Ну ладно, заходи."
    "Я сразу подошёл к кровати, сбросил вещи и взял мои пионерские со шкафа."
    "Ольга Дмитриевна смотрела на меня глазами по пять копеек."
    show mt surprise pioneer  at center with dspr
    th"И тут я понял..."
    th"За всё время прибывания в лагере я не видел здешних денег..."
    th"Совсем..."
    th"Не ужели тут всё за даром?"
    th"Или может это ещё одна тайна, которую от меня прячут."
    th"Узнав которую я разоблачу причину своего прибывания здесь.."
    th"Хотя вряд-ли из-за пяти копеек я узнаю столько всего. "
    "И тут в реальность меня вернула Ольга Дмитриевна."
    show mt angry pioneer at center with dspr
    mt"Ты что себе позволяешь?!?"
    mt"Вламываешся в домик, раскидываешся вещами!"
    mt"Разве так себя видёт настоящий пионер?!"
    mt"Да и на пионера ты не похож!"
    th"Блин...Это же первый день.."
    th"Как я мог забыть..."
    sd"Извините, пожалуйста. Меня Данил зовут!"
    show mt normal pioneer at center with dspr
    mt"Данил, значит..."
    mt"Данил, ты почему себя ведёшь как бандит какой-то?"
    mt"Ты же хочешь стать пионером?"     
    "Я им стал уже почти месяц назад..."
    sd"Конечно, хочу. Извините меня пожалуйста. Больше не повторится."
    "Сказал я провинившимся голосом."
    mt"Хорошо Данил. Меня зовут Ольга Дмитриевна и я вожатая этого пионер-лагеря."
    show mt smile pioneer at center with dspr
    th"Будем считать, что я этого не знал."
    sd"Хорошо Ольга Дмитриевна, можно я пойду?"
    "Мне надо бы поскорее ускользнуть."
    mt"Ну завтрак и линейку ты уже пропустил, так что можешь идти."
    th"Наконец-то!"
    "Я развернулся и направился в сторону выхода."
    hide mt smile pioneer with dissolve
    "Как тут меня опять окликнула Ольга Дмитриевна."
    show mt angry pioneer at center with dspr
    play music music_list["doomed_to_be_defeated"] fadeout 2
    mt"Данил!"
    mt"А откуда ты знаешь где лежали запасная одежда для пионера?"
    th"Вот это я встрял.."
    th"Надо думать логически!"
    sd"А...Я..."
    th"Думай! ДУМАЙ!"
    sd"Я просто..."
    show mt sad pioneer at center with dspr
    "И тут раздался громкий вопль!"
    "Где-то с улицы!"
    "Видимо ловушка Ульяны сработала!"
    "Ольга Дмитриевна кинулась из домика, чтобы посмотреть причину таких ужасно громких звуков."
    hide mt normal pioneer with dissolve
    "Я вышел следом."
    scene ext_washstand_day with dissolve
    show mz normal glasses pioneer at right with dspr
    show mt rage pioneer at cleft with dspr
    show us fear pioneer at left with dspr
    "Там стояла Женя.."
    th"Но почему-то..."
    th"Чистая?"
    th"Значит где-то Ульяна прокололась..."
    stop music fadeout 2
    play music music_list["everyday_theme"] fadeout 2
    th"Придумывать ловушки - это одно дело..."
    th"А вот сделать так чтобы она сработала в нужном месте, в нужном времени..."
    th"До такого ей ещё далеко."
    "Из монолога меня выдернули крики Ольги Дмитриевны на провинившуюся Ульяну."
    "А рядом стояла лишь слегка запачканая Женя, сложившая руки и наблюдавшая за громким отчётом Ульянки.."
    th"Она там ещё не оглохла?"
    th"Ведь и вправду.."
    th"Стоя в 10-20 метрах от разгневанной Ольги Дмитриевны мне было всё очень хорошо слышно."
    th"ОЧЕНЬ!"
    th"Наверное стоять вблизи от взрыва и не оглохнуть.."
    th"Задача непростая..."
    "Постояв там меньше 10 секунд, я захотел по быстрее уйти."
    "Думаю не надо объяснять почему."
    "Думаю стоит пойти на пляж."
    "Но плавки находятся в домике Ольги Дмитриевны"
    th"Точно!"
    th"Её сейчас лучше не беспокоить..."
    th"Поэтому обойдёмся без пляжа..."
    th"Может стоить проверить Электроника и Шурика?"
    "ВОТ! Хорошая идея!"
    th"Я что, начинаю разговаривать сам с собой?"
    "Да ну!"
    th"И я про тоже!"
    "Я направился к зданию кружков."
    scene ext_square_day with dissolve
    "Проходя мимо Генды, на площади, я увидел Славю."
    "Она что-то искала в траве.."
    th"Не буду ей мешать"
    "Пройдя мимо Слави я покинул площадь"
    scene ext_clubs_day with dissolve
    "И уже стоял перед зданием кружков."
    "После кибернетиков можно будет зайти к длинноволосой."
    play sound sfx_open_dooor_campus_1 fadeout 2
    scene int_clubs_male_day with dissolve
    "Я зашёл внутрь."
    "Но там никого не было."
    "Пока я шёл от домика Ольги Дмитриевны до здания кружков, я их не наблюдал"
    play sound sfx_open_dooor_campus_1 fadeout 2
    scene int_musclub_day with dissolve
    "Я вошёл в кружок музыки."
    "Но Мику там не было.."
    th"Да чтож такое!"
    th"Хорошо..Куда можно отправится?"
    th"Может..."
    "Я поудмал о спортивной площадке."
    th"Но ведь сейчас жара."
    th"Лучше вечером..."
    th"Либо никогда."
    "Я любил заниматся спортом."
    "Но не в жару +30"
    th"Надо пойти умыться"
    "И с мыслями о приятной лединящей, освежительной воде из умывальника"
    scene ext_square_day with dissolve
    "Я отправился в сторону 'купальни'."
    "В такую жару ледяная вода станет...Чутка теплее."
    "Подходя к умывальникам я вспомнил свою первую встречу с водой из антарктиды."
    th"Даже холодно вспоминать."
    th"Ту ду Тыщ.."
    "Я вытянул пальцы и сделал жест, будто играю на барабанах."
    scene ext_washstand_day with dissolve
    "Выкрутив крутилку возле крана, я набрал в руки воды."
    scene ext_washstand2_day with dissolve
    "По ощущениям она не отличалась от первого раза."
    th"Видимо мой прогноз не сработал."
    "Но от такой жары как-то надо спасатся."
    "Я закрыл глаза и плеснул воду в лицо."
    play sound sfx_water_splash fadeout 2
    th"А-а-а-а!!"
    th"Освежающе."
    th"Хорошо!"
    "Вода была просто не выносимо холодной."
    "Но жара согревала её до состояния...холодной."
    "Сзади кто-то подошёл и дёрнул меня за плечо."
    "Я обернулся и увидел там Электроника."
    scene ext_washstand_day with dissolve
    show el laugh pioneer at center with dissolve
    el"Привет! С тобой всё хорошо?"
    th"От того что я слишком сильно закрыл глаза, моё лицо было красным."
    sd"Да, да..."
    el"Тебе лицо не морозит?"
    "С насмешкой спросил меня Электроник."
    sd"Есть чутка."
    "Ответил я дрожащим голосом."
    el"Я кстати Электроник. Настоящий! Можешь меня так и звать."
    th"Да да..."
    sd"Меня Данил."
    el"Меня Ульянка ещё Сыроежкой зовёт."
    el"У меня просто фамилия - Сыроежкин."
    th"Мы пожали руки."
    "И вовремя нашего дружеского рукопожатия прозвенел звонок на обед."
    play sound sfx_dinner_horn_processed fadeout 2
    show el smile pioneer at center with dspr
    el"Пойдёшь?"
    sd"Конечно."
    "И вместе с Электроником мы отправились в столовую."
    "Подойдя к столовой, я увидел привычную мне..."
    scene ext_dining_hall_away_day with dissolve
    "Да и этому месту толпу пионеров, пихавшись возле входа."
    "Кстати, Алисы здесь не наблюдалось."
    th"Странно, может она в толпе пионеров спряталась?"
    th"Ну.."
    th"Одним Электроником целее"
    "Возле входа Ольга Дмитриевна, которая пытается успокоить толпу голодных детей."
    "Всё это казалось уже обыденным, слишком обыденным."
    "И всё же, Ольга Дмитриевна впустила толпу оголодавших зверей."
    "Мы вошли следом."
    scene int_dining_hall_people_day with dissolve
    "Когда мы вошли в столовую, детей было слишком много."
    "Электроник попрощался и сел за столик к Шурику."
    "А я остался в скитании по столовой в надежде найти свободное место."
    "Через минуту безмятежной хотьбы по клетчатому полу, меня позвала Ольга Дмитриевна."
    show mt normal pioneer at center with dissolve
    mt"Данил, ты чего бродишь?"
    sd"Место не могу найти..."
    mt"Пошли поищем."
    "Она взяла меня за руку и потащила обсматривать столы."
    "В итоге место нашлось."
    "Рядом с Алисой и недавно провинившейся Ульянкой."
    mt"Вот смотри."
    sd"Да, хорошо,Спасибо."
    hide mt normal pioneer with dissolve
    th"Присев на стул, я смотрел на Алису."
    show dv smile pioneer2 at left with dissolve
    show us smile pioneer at right with dissolve
    th"Ох...Она прекрасна.."
    dv"Чего пялишся?"
    show dv grin  pioneer2 at left with dspr
    "Я резко опустил голову в тарелку."
    dv"На сиськи или на лицо?"
    show dv laugh pioneer2 at left with dspr
    show us laugh pioneer at right with dspr
    "Ульянка закрыв рот начала хихикать."
    dv"Чего молчишь? Стыдно стало?"
    "Я заметно покраснел."
    us"Или влюбился?"
    "Вот тут я был шокирован."
    "Она меня видит несколько минут, а уже такие глаголы про меня говорит."
    dv"Тебя хоть как зовут?"
menu:                    
        "Сказать имя":
            $ us_ochki += 1
            jump Mods_Arseny_Danil_Vlad_Artem_day_1_2
            
        "Ничего не говорить":
            $ us_ocki = 0
            jump Mods_Arseny_Danil_Vlad_Artem_day_1_3
label Mods_Arseny_Danil_Vlad_Artem_day_1_2:
    sd"Данил меня звать.А вас девчата как?"
    "Они явно не ожидали такого дерзкого и резкого ответа."
    show dv shy pioneer2 at left with dspr
    dv"А..А меня Алиса."
    show us normal pioneer at right with dspr
    us"Меня Ульяна."
    "Добавила Ульяна."
    sd"Ладно, я пойду."
    "Сказал я увернно и без единого промаха."
    show dv normal pioneer2 at left with dspr   
    dv"Иди,иди."
    "Я поставил тарелку и вышел из столовой."
jump Mods_Arseny_Danil_Vlad_Artem_day_1_4
label Mods_Arseny_Danil_Vlad_Artem_day_1_3:
    show dv normal pioneer2 at left with dspr
    show us surp2 pioneer at right with dspr
    us"Может он немой или глухой?"
    "Так как это было слишком резко я не знал что им и ответить..."
    "Ульяна начала мне что-то показывать пальцами..."
    "Думая что я глухой."
    show us upset pioneer st right with dspr
    us"Скучный ты какой-то..." 
    sd"Данил меня зовут."
    "Сказал я дрожащим голосом."
    show us grin pioneer at right with dspr
    dv"Наконец-то!"
    "Я быстро доел, и направился к выходу."
label Mods_Arseny_Danil_Vlad_Artem_day_1_4:
    scene ext_dining_hall_near_day with dissolve
    "Выйдя из столовой, я решил направится к кружкам и снова попытать удачу."
    "Только на этот раз я решил сразу зайти к нашему музыканту."
    th"Или музыкантке..."
    th"Ну вообщем суть понята."
    scene ext_musclub_day with dissolve
    play sound sfx_drawer_rattle fadeout 2
    "Подойдя к зданию кружков, я инстинктивно хотел открыть дверь, но врезался, так как она была закрыта."
    th"Ну значится на второй день..."
    "Далее я решил пойти на пляж."
    "Так как теперь нет особых проблем взять плавки у Ольги Дмитриевны."
    th"Именно так мы и поступим!"
    "С такой позитивной нотой я направился к Ольге Дмитриевне."
    scene ext_house_of_mt_day with dissolve
    "Стоя возле порога в домик Ольги Дмитриевны, я обязательно..."
    play sound sfx_knock_door7_polite fadeout 2
    th"ПОСТУЧАЛСЯ!"
    "После чего вошёл."
    play sound sfx_medpunkt_door_open
    scene int_house_of_mt_day with dissolve 
    "Но в домике никого не было.."
    th"Блин, не показал Ольге Дмитриевне свою воспитанность."
    "Взяв плавки из шкафа, я переоделся и пошёл на пляж."
    scene ext_beach_day with dissolve
    play ambience ambience_lake_shore_day fadeout 2
    "На пляжу никого не было."
    th"Меньше народу-больше кислороду!"
    "Окунув палец в воду я убедился что она была тёплой."
    "По-крайней мере теплее воды из умывальников."
    "На пару тысяч градусов."
    "Оставив вещи на песке..."
    "Я со спокойной душой вошёл в воду."
    play sound sfx_water_emerge fadeout 2
    "Зайдя в воду все мысли как будто смыло."
    "Я зашёл подальше на глубину."
    "Чтобы просто лечь пластом на воде."
    "Закрыть глаза.."
    show blink 
    "И просто помечтать.."
    "О себе..."
    "О моей жизни..."
    "О том как попал сюда..."
    "О этом лагере..."
    "О его обитателях..."
    "О Алисе..."
    th"О Алисе..."
    "Мои мысли расплывались у меня в голове..."
    "Будто я сейчас лежу в облаках..."
    "И меня совершенно не заботит то, что происходит тут.."
    "На земле."
    "Какие-же мы ничтожно мелкие."
    "От сюда все проблемы кажутся такими лёгкими."
    "Будто я могу их сдуть..."
    "Так.."
    th"Фу-у-ух"
    "И всё..."
    "Я дома.."
    "Пью либимый чай..."
    "Смотрю видео..."
    "И поедаю печеньки..."
    "Меня отвлекла попавшая в нос вода."
    "Открыв глаза, я увидел что уже ночное небо усыпанное звёздами."
    "А такой пейзаж мог значить только одно."
    show unblink
    scene ext_beach_night with dissolve
    th"НОЧЬ!?!"
    stop music fadeout 2
    play ambience ambience_lake_shore_night fadeout 2
    th"Сколько я спа...ПЛАВАЛ??"
    "Я брасом поплыл до берега."
    "Начал бегать по берегу в надежде найти мои вещи."
    "Но, там где я их остовлял вещей не было..."
    th"Ну конечно, мог бы догадатся..."
    th"Слишком банально."
    "Надо было спешить."
    scene ext_square_night with dissolve
    stop ambience fadeout 2
    play ambience ambience_camp_center_night fadeout 2
    "Я напролом побежал через площадь в домик Ольги Дмитриевны."
    "Хорошо что была ночь и на улице никого не было."
    scene ext_house_of_mt_night_without_light with dissolve
    "Стоя на пороге в домик Ольги Дмитриевны, я глубоко вздохнул."
    "Придумал заренее отговорку на вопросы..."
    th"Где ты был?"
    th"Почему так поздно?"
    th"Почему ты в плавках?"
    th"Отлично"
    "И сполной уверенностью в своих отговорках открыл дверь."
    play sound sfx_medpunkt_door_open
    scene int_house_of_mt_night2 with dissolve
    "Как не странно, но Ольга Дмитриевна уже спала."
    "Но вот остался только один вопрос."
    th"Что с одеждой делать?"
    "Так как я знал что это 100 процентов были девчонки."
    "Надо наведатся к ним."
    "Посмотрев на часы, я увидел время"
    "22:00"
    "Интересно, почему Ольга Дмитриевна не похватилась меня искать?"
    th"Может ей плевать что у неё стало на одного пионера меньше."
    th"Так ещё и того, который живёт с ней в ОДНОМ ДОМИКЕ!!!"
    th"Но сейчас не об этом."
    "Девочки сейчас по-любому спали."
    "Я направился к ним в домик."
    scene ext_house_of_dv_night with dissolve
    play sound sfx_close_door_campus_1
    "Так что я стоял возле двери в домик девочек."
    "В голове крутилась одна мысль"
    th"Будь открыт!"
    "Я дёрнул ручку двери."
    "И..."
    "Она была..."
    play sound sfx_campus_door_rattle
    "Закрыта."
    "Ну хоть на что-то они способны, кроме их дебильных шуток."
    "Я решил обойти дом, в надежде увидеть там открытую форточку."
    "На улице было жарко, так что почему бы и нет."
    "Судьба оказалась благородна ко мне, ведь форточка была открыта."
    "Прям как в каких-нибудь фильмах про шпионов."
    "Положив руки на раму, я опёрся и..."
    "Застрял."
    th"Чёрт!"
    "Зачем делать такие узкие форточки?"
    "Производители привидели пионера в мокрых плавках, который пытается проникнуть в домик к девочкам."
    "Как какой-то извращенец."
    th"А ОНИ ФЕТИШИСТКИ!!!"
    th"РАЗ УЖЕ ВЕЩИ БЕРУТ!"
    "Просунув руки сквозь форточку, я поставил ноги на стол."
    scene int_house_of_dv_night2 with dissolve
    "И благополучно проник в домик к девочкам."
    "Надо менее извращентски формулировать мысли."
    "Свет включить я не мог"
    "По понятным причинам."
    "Так что пытался нащупать свои вещи."
    th"Хотя..."
    "Вспомнив, что глаз имеет процесс темновой адаптации."
    "Это когда глаз через некоторое время может привыкнуть к темноте."
    "Я стоял не подвижно."
    "И я не знал сколько мне надо было так стоять."
    "Но времени у меня много."
    "Хотя про болезни девчонок я не знал."
    th"Может они лунатят?"
    "Или кто-то захочет по среди ночи попить воды."
    th"Или сходить в туалет."
    th"А тут я.."
    th"Как же они испугаются."
    "Я хихикнул."
    "Через минут 6, я уже начал что-то различать в темноте."
    "Но сзади послышался скрип кровати."
    "Я обернулся."
    "В моей голове было куча мыслей."
    "Если они меня увидят, то что подумают?"
    "Извращенец, Маньяк, Педофил?"
    "Или они сначало завезжат?"
    "Обернувшись, я увидел Алису."
    "Которая переворачивалась в кровати."
    th"Аа-а-а-а-а!!"
    "Прокричал я про себя."
    "К этому времени я начал уже видеть в темноте."
    "Более менее."
    "Этого хватало чтобы различить мои вещи."
    "Я увидел что, вещи весят на спинках кровати Алисы и Ульяны."
    "В знак отомщения, я взял их вещи со спинки кровати и выбросил в окно."
    th"Позже спрячу."
    "Но в чём тогда они спят?"
    "Вот такая шедевральная мысль мне пришла, находясь в закрытом домике двух спящих, ничего не подозревающих девочек."
    "Одной из которых даже нету 18..."
    "По моим данным."
    th"Так! Не отвлекатся."
    "Разумно было предположить, что вещи на спинках кровати- это вещи девчонок."
    "Но моих вещей не наблюдалось..."
    th"Может в шкафу?"
    "Подойдя к шкафу, я взялся за дверцу."
    "Она предательски скрипнула..."
    th"Сука!"
    "Моё сердце билось настолько сильно, что стуки были громче самого скрипа."
    "Оккуртно открыв дверь, там были только купальники и другие вещи."
    "Но не мои..."
    "Может под кроватью?"
    "Нагнувшись под кровать Алисы, я увидел там только пионерскую обувь."
    "Под кроватью Ульяны было тоже самое."
    "Тогда.."
    th"ГДЕ МОИ ВЕЩИ?!?"
    "Вот тут я не на шутку испугался."
    th"Так..Спокойствие.."
    th"Я остался запертым в домике с двумя девочками, которые увидев меня, испортят мне ВЕСЬ ОСТАВШИЙСЯ ЦИКЛ."
    th"Просто надо оккуратно свалить."
    "Я решил что можно выйти либо так, как я пришёл, но это очень рискованно."
    "Либо найти ключ и выйти как обычно, но потом закрыть дверь и подбросить ключ."
menu:
    "Вылезти через форточку":
        jump Mods_Arseny_Danil_Vlad_Artem_day_1_5
    "Выйти через дверь":
        $ day_1_exit_door = 1
        $ dv_ochki += 1
        $ us_ochki += 1
        jump Mods_Arseny_Danil_Vlad_Artem_day_1_6
     
label Mods_Arseny_Danil_Vlad_Artem_day_1_5:
    th"Была не была"
    "Я попытался оккуратно залесть на стол."
    "Но он шатался."
    "Почему я этого не подметил когда взберался сюда впервые?"
    "Вместе со столом шатался и я, когда стал на него двумя ногами."
    "Больше всего я боялся что он сломается."
    "Взявшись за оконную раму, я просунул туда руки и вылез из домика."
    "Но..Упал на траву."
    play sound sfx_bodyfall_1
    scene ext_house_of_dv_night with dissolve
    "Конечно, было больно, но сейчас было не до этого."
    "Увидев на земле вещи девочек, я решил всё же вернуть их."
    "Чтобы завтра они не навели шороху."
    "Но положить обратно на спинку кровати я их уже не смогу."
    "Поэтому я выбрал вариант просто..."
    "Докинуть."
    "Разделив где-чьи вещи, я с розмаху пытался кинуть на кровать"
    "Но в итоге они просто разлетелись по комнате..."
    th"Ладно, сейчас не об этом."
    "Я развернулся и пошёл в домик Ольги Дмитриевны."
jump Mods_Arseny_Danil_Vlad_Artem_day_1_7
label Mods_Arseny_Danil_Vlad_Artem_day_1_6:
    "Думаю более логичным будет, найти ключ и просто выйти отсюда."
    "Только где его искать?"
    "Хорошо, я с ними не первый цикл."
    "Если хорошо вспомнить, то..."
    "Я закрыл глаза и попытался вспомнить мнгновения с Алисой."
    th"И почему я не рассматривал комнату?"
    th"Если логически подумать?"
    "На столике?"
    th"На столике!"
    "И к моему удивлению, он находился именно там."
    scene ext_house_of_dv_night with dissolve
    play sound sfx_close_door_clubs_nextroom
    "Я взял ключ, отомкнул дверь и просто вышел."
    "Не забыв запереть за собой дверь."
    "Обойдя дом, чтобы закинуть ключ обратно, на глаза мне попалась их одежда."
    th"Пусть лежит."
    th"Будет им уроком."
    "Закинув ключ, а он упал довольно громко, я направился к домику Ольги Дмитриевны."
    label Mods_Arseny_Danil_Vlad_Artem_day_1_7:
    scene ext_house_of_mt_night_without_light with dissolve
    "По пути я размышлял."
    th"Кто мог взять мои вещи?"
    th"Может я зря с ними так поступил?"
    "Но больше меня волновал первый вопрос."
    "Ведь кроме них двоих шутников у нас нету."
    play sound sfx_medpunkt_door_open
    scene int_house_of_mt_night2 with dissolve
    "Зайдя в домик Ольги Дмитриевны, я думал что она мне скажет завтра и будет ли она меня пытать?"
    play sound sfx_blanket_off_stand
    "Накрывшись одеялом, я вздохнул и скоро заснул."
    $ backdrop = "days"
    show blink
    pause(2)
    $ new_chapter(2, u"День первый.")




#




#                                                                                                    ██████╗░
#                                                                                                   ╚════██╗
#                                                                                                    ░░███╔═╝
#                                                                                                    ██╔══╝░░
#                                                                                                    ███████╗
#                                                                                                    ╚══════╝



#



label Mods_Arseny_Danil_Vlad_Artem_day_2_1:
    stop ambience
    play music music_list["a_promise_from_distant_days_v2"] fadeout 4
    scene int_house_of_mt_day with dissolve
    "Когда я проснулся?"
    "Я так и не понял."
    "Но лежал с закрытыми глазами долго, притворяясь спящим."
    "Лежал я так ещё минуты четыре."
    "После чего осмелился открыть глаза."
    "Подняв своё тело с кровати, я увидел пионерскую форму лежащую у меня на ногах."
    "Я лишь протёр глаза и удостоверился, что она моя."
    th"Моя..."
    "Я был шокирован."
    "В голове крутились тысячу и одна мысль.."
    th"Кто?"
    th"Почему?"
    th"Как мимо Ольги Дмитриевны пронесли мои вещи?"
    "И ещё куча подобных."
    "Обсмотрев её с недоверием"    
    "Я всё же решился одеть."
    "Часы показывали, что я пропустил завтрак"
    th"Ну конечно."
    "Когда я оделся, мой взгляд пал на кровать Ольги Дмитриевны."
    "Но её там не оказалось."
    th"Почему она меня не разбудила?"
    th"Может подобрела?"
    th"А как же ленейка?"
    th"Найду-Спрошу"
    "А пока я направился к выходу из домика."
    scene ext_house_of_mt_day with dissolve
    play sound sfx_slam_door_campus
    play ambience ambience_camp_entrance_day fadeout 3
    th"Сейчас Ольга Дмитриевна должа встретить меня."
    "Когда я вышел, меня ослепил солнечный свет."
    "Я прикрыл глаза руками."
    "И стоял так, пока не привык к очень яркому солнечному свету"
    "Ко мне всё же подошла Ольга Дмитриевна."
    show mt smile pioneer far with dissolve
    mt"Доброе утро, Данил!"
    th"Как и ожидалось."
    sd"Доброе!"
    mt"Ты только вчера приехал, так что будить я тебя не стала, но завтрак-то..."
    mt"Хотя ладно! Вот, держи!"
    "Она протянула мне бумажный свёрток в котором находились бутерброды с завтрака."
    mt"Кстати Данил, я смотрю ты уже форму получил."
    "Вот тут я знатно прифигел"
    mt"Если что её мне принесла Ульяна."
    mt"Я так поняла, что когда ты был на пляже они умыкнули твою форму."
    mt"Ведь спал ты в плавках"
    show mt grin pioneer far with dspr
    "Ольга Дмитриевна хихикнула."
    show mt surprise pioneer far with dspr
    mt"Кстати!"
    "Ольга Дмитриевна забежала в домик и вернувшись, вручила мне пакетик с рыльно-мыльными вещами. "
    show mt smile pioneer far with dspr
    mt"Пионер должен быть всегда чист и опрятен!"
    mt"Дай я тебе галстук завяжу..."
    sd"Не надо..."
    sd"Я умею."
    "Ведь за несколько циклов опыт по завязыванию пионерского галстука у меня уже был."
    "Завязав галстук, Ольга Дмитриевна действительно убедилась в этом."
    mt"Отлично!"
    mt"Ты, я надеюсь, про линейку не забыл?"
    th"Забудешь тут с вами!"
    sd"Нет, не забыл."
    mt"Так как сегодня понедельник..."
    sd"... поэтому она будет в 12 часов."
    show mt normal pioneer far with dspr
    "Перебил я Ольгу Дмитриевну."
    sd"Говорю же - знаю!"
    "Ольга Дмитриевна приоткрыв рот смотрела на меня недоумевая"
    show mt smile pioneer far with dspr
    mt"Да Данил, правильно."
    mt"Ты становишь образцовым пионером!"
    mt"Молодец!"
    mt"А теперь марш умыватся!"
    th"Отлично!"
    th"Грех за Не постучавшегося Данила - искуплен."
    "Но покоя мне не давали слова Ольги Дмитриевны."
    "Я направился далее, к умывальникам."
    scene ext_washstand2_day with dissolve
    "Стоя возле умывальников, я с болью в лице и зубах вспоминал их приятную, леденящую до костей, бодрящую водичку."
    "В пакетике с рыльно-мыльными принадлежностями я взял зубной порошок, насыпал себе на палец и начал чистить зубы."
    th"С богом!"
    stop sound 
    play sound sfx_close_water_sink
    "Умылся я быстро."
    "Ведь холодная вода медлить не давала."
    scene ext_washstand_day with dissolve 
    "Я уже собирался уходить, как тут меня нагнала Славя."
    show sl normal sport far with dissolve
    "Она была одета в спортивный костюм."
    "Этот костюм сидел на ней особенно хорошо..."
    th"Но я больше по Алисам..."
    th"Если бы где-то в параллельной реальности, где у меня с Алисой всё отлично шло."
    th"Она бы услышала, что я назвал её в множественном числе."
    th"Она была бы зла..."
    "И тут со мной поздаровалась Славя."
    show sl happy sport with dspr
    sl"Фискульт-привет!"
    "Радостно поздаровалась она со мной."
    sd"И тебе доброе утро."
    show sl smile sport with dspr
    sl"Почему на завтрак не пришёл?"
    sd"Голоден не был. Генерал Спортикус!"
    show sl laugh sport with dspr
    "Славя засмеялась."
    show sl smile sport with dspr
    sd"Мне Ольга Дмитриевна бутерброды принесла."
    th"Так хочется сказать - бутеры..."
    sl"А, ну отлично тогда! Не забудь про линейку!"
    sd"Конечно."
    sl"Ладно, я побежала, не скучай!"
    hide sl smile sport with dissolve
    "Она помахала мне рукой и продолжила бежать по тропинке."
    "Теперь надо пойти в домик и оставить там пакетик с мыльно-рыльными пренадлежностями."
    scene ext_houses_day with dissolve
    "По пути я размышлял о многом."
    th"Какой сейчас год?"
    th"Что будет с девочками в моём времени?"
    th"Бесконечна ли местность, где находится лагерь?"
    "И с каждым вопросом, я всё сильнее погружался в себя."
    th"Если совместить хлеб и утку, то перестанет ли она есть хлеб, или будет питатся собой пока не останется только корка?"
    "И всё в таком духе..."
    scene ext_house_of_mt_day with dissolve
    stop music
    play music music_list["awakening_power"] fadeout 3
    "Подойдя к домику Ольги Дмитриевны я был уже полностью погружён в себя."
    "И совершенно отключил память."
    scene d2_mt_undressed_me with dissolve
    play sound sfx_medpunkt_door_open fadeout 5
    "Открыв дверь в домик, я увидел там переодевающуюся Ольгу Дмитриевну."
    "На этом моменте, я вернулся из сознания."
    "Я забыл совершенно всё, о чём думал несколько минут назад."
    sd"Я...А..Просто.."
    scene d2_mt_undressed_2_me with dissolve
    mt"Данил!?"
    mt"ТЫ ОПЯТЬ БЕЗ СТУКА?!?"
    sd"Извините, пожалуйста."
    "Кинув на кровать всё что мне мешало прийти на площадь, я продолжил"
    sd"Больше не повторится!"
    stop music
    play music music_list["a_promise_from_distant_days_v2"] fadeout 3
    play sound sfx_slam_door_campus fadeout 3
    scene ext_house_of_mt_day with dissolve
    "Я быстро захлопнул дверь, и побежал на площадь."
    th"Как я мог забыть?!?"
    "Не мудрено, ведь на сколько надо погрузится в себя чтобы задавать вопросы на подобии:"
    th"Что будет если смешать сладкий кофе и солёный чай?"
    th"Станут ли они противоречием друг-друга или это будет супер-дупер напиток."
    th"Ха-ха"
    "Я уже начинаю сходить с ума..."
    scene ext_square_day with dissolve
    "Подбежав к площади, я увидел в шеренгу построенных пионеров."
    "Где слево стояла Алиса, а справо в начале Электроник."
    show mt smile pioneer far with dissolve
    "Следом за мной пришла Ольга Дмитриевна."
    mt"Данил, встань в строй!"
    "Я покорно выполнил приказ."
    play music music_list["confession_oboe"] fadeout 3
    scene d2_lineup with dissolve
    "Ольга Дмитриевна как обычно рассказывает о спортивных соревнованиях и о планах на неделю."
    "Но в этот раз мне было интересно, что значат флаги над головой Генды."
    th"Красный,Зелёный,Синий."
    th"Может это не зелёный, а жёлтый?"
    th"Ну, красный и жёлтый это понятно - цвета флага СССР."
    th"Но при чём тут синий?"
    th"Или это может цвета флага это лагеря."
    th"Но почему тогда просто не повесить флаг?"
    scene ext_square_day with dissolve
    show sl smile2 pioneer at cleft with dissolve
    show mt smile pioneer with dspr
    mt"Данил, ты всё запомнил?"
    sd"Так точно!"
    show mt grin pioneer with dspr
    mt"Вот и отлично!"
    show mt smile pioneer with dspr
    th"Если бы я сказал 'нет', я бы опять узрел злое лицо Ольги Дмитриевну и её фирменную позу в виде букву \"Ф\"."
    "На что смотреть надо крайне редко."
    th"Иначе она своим взгядом сделает во мне дырку."
    "Рядом с вожатой стояла Славя."
    mt"Принесла?"
    show mt surprise pioneer with dspr
    sl"Да."
    show sl smile pioneer with dspr
    "В руках у неё был мой 'любимый' обходной лист."
    "Который она протянула мне."
    mt"Это обходной лист. Тут четыре позиции. За сегодня тебе нужно везде отметиться."
    mt"Во-первых, записаться в клуб, они у нас в здании кружков и отдельно - музыкальный."
    mt"Во-вторых, в  медпункт зайти."
    mt"Ну, и в-третьих - в библиотеку."
    show mt angry pioneer with dspr
    mt"Всё понял?"
    show mt smile pioneer with dspr
    sd"Да."
    th"Бла-бла-бла."
    "Я уже начинал уставать от этой болтавни."
    mt"Тогда давай, начинай прямо сейчас."
    sd"Хорошо!"
    "Я вышел из строя и пошёл по направлению к..."
    #Тут идёт карта: от выбора ничего не зависит.

    $ disable_all_zones()
    $ set_zone("clubs", "Mods_Arseny_Danil_Vlad_Artem_day_2_2")
    $ set_zone("dining_hall", "Mods_Arseny_Danil_Vlad_Artem_day_2_2")
    $ set_zone("library", "Mods_Arseny_Danil_Vlad_Artem_day_2_2")
    $ set_zone("medic_house", "Mods_Arseny_Danil_Vlad_Artem_day_2_2")
    $ set_zone("music_club", "Mods_Arseny_Danil_Vlad_Artem_day_2_2")

    $ show_map()

label Mods_Arseny_Danil_Vlad_Artem_day_2_2:
    scene ext_square_day with dissolve
    th"Естественно обходить ВСЁ я не собирался."
    "Зная то, что Ольга Дмитриевна не будет смотреть в листок, я решился просто подделать подписи."
    "За несколько недель я их уже выучил."
    th"Только надо найти ручку."
    th"А ручку можно найти в медпункте."
    "Куда я и направился."
    scene ext_houses_day with dissolve
    "Проходя средь домиков"
    "Я думал о том, почему именно мне дали обходной?"
    th"Почему не Ульяне например?"
    th"Она быстрее меня."
    th"Шустрее."
    th"То что мне делать минут 20, она справится за минут 5."
    th"Пробежалась по всем этим позициям и всё."
    scene ext_aidpost_day with dissolve
    "Тем временем, я уже подходил к медпункту."
    th"Впринцепе можно попросить у неё роспись и после взять ручку."
    "Эта мысль показалась мне разумной."
    play sound sfx_medpunkt_door_open
    scene int_aidpost_day with dissolve
    show cs normal stethoscope far with dissolve
    "Я вошёл в медпункт."
    "Там была медсестра."
    "Она сидела за столом и что-то писала."
    "Её звали Виолой."
    sd"Здравствуйте!"
    show cs smile stethoscope with dspr
    cs"Ну, здравствуй... пионер."
    "Сказала она, продолжая писать что-то."
    sd"Да..."
    sd"Можете подписать обходной?"
    cs"Конечно, положи на стол."
    "Я послушался."
    cs"Присаживайся."
    sd"Я постою."
    "Пытался сопротивлятся я."
    cs"Ну что же тебе стоять?"
    sd"Хуже не будет."
    "Парировал я."
    show cs normal stethoscope with dspr
    "Она сделала уважающую мимику лица."
    th"Вот так себя видёт альфа-самец."
    cs"Может болит что? Или что-то беспокоит?"
    sd"Да нет, пока огурчик."
    "\"Парировал \"х2."
    sd"И ещё когда подпишите, можете ручку ненадолго одолжить?"
    show cs smile stethoscope with dspr
    cs"Да, конечно."
    th"Отлично!"
    "Я уже чувствовал вкус победы."
    "И тут я решил спросить:"
    sd"У вас случаем нету зелёного яблока?"
    "Спросил я на несколько дней вперёд."
    show cs normal stethoscope with dspr
    cs"Нет, а что, голоден?"
    sd"Недостаток витаминов у меня."
    "Грустно сказал я и вздохнул."
    th"Ух..И мастер я заигрывать."
    show cs smile stethoscope close with dspr
    "Закончив писать бумажки медсестра пподошла ко мне."
    "Она протянула мне листок."
    cs"Меня если что Виолетта зовут, но ты можешь звать меня Виолой."
    th"Да-да..."
    sd"Хорошо."
    "Она протянула мне шариковую ручку."
    cs"И чтоб вернул потом."
    show cs normal stethoscope close with dspr
    "Сказала она угрожающим голосом."
    sd"Обязательно!"
    "Я развернулся и вышел из медпункта."
    play sound sfx_close_door_1
    scene ext_aidpost_day with dissolve
    th"На что бы оперется?"
    "Решил писать на стенке медпункта."
    "Надеясь что никто меня не увидит."
    "Осмотревшись я преступил."
    "И на удивление, меня никто не потревожил."
    "Я успешно подписал обходной и пошёл до Ольги Дмитриевны."
    "Но по пути меня настиг вопрос."
    th"Не слишком ли быстро?"
    th"А если что-то заподозрит?"
    th"Тогда она точно посмотрит."
menu:
    "Гулять":
        jump Mods_Arseny_Danil_Vlad_Artem_day_2_3
        $ is_hodil_brodil = 1
    "Пойти к Ольге Дмитриевне":
        jump Mods_Arseny_Danil_Vlad_Artem_day_2_7

label Mods_Arseny_Danil_Vlad_Artem_day_2_3:
    th"Лучше время потяну."
    "Ну не буду же я сидеть без дела."
    "Да и до обеда ещё далеко."
    
    $ disable_all_zones()
    $ set_zone("beach", "Mods_Arseny_Danil_Vlad_Artem_day_2_4")
    $ set_zone("boat_station", "Mods_Arseny_Danil_Vlad_Artem_day_2_5")
    $ set_zone("estrade", "Mods_Arseny_Danil_Vlad_Artem_day_2_6")

    $ show_map()

   #*Пляж*'+1'  *Лодочная станция*  *Сцена*
label Mods_Arseny_Danil_Vlad_Artem_day_2_4:
    $ dv_ochki += 1
    scene ext_aidpost_day
    "Я решли направится на пляж."
    "Освежится, позагарать."
    "Но купатся я не собирался."
    "Иначе я просто не успею высохнуть."
    scene ext_beach_day with dissolve
    play ambience ambience_lake_shore_day fadeout 5
    "Когда я пришёл на пляж, я увидел нескольких пионеров младше меня."
    "Которые резвились в воде и играли с мячом."
    "Подойдя к воде, я окунул палец руки в воду."
    "Она была на столько тёплой, что я хотел просто в ней растворится."
    "Как порошок."
    "Ещё я заметил какая вода прозрачная."
    th"Значит чистая."
    "Я сел возле воды и смотрел на отражение.."
    th"Или на дно?"
    th"Не суть."
    "В пионерской форме было жарко."
    "Я хотел снять рубашку."
    "И расстегнул две верхние пуговицы."
    th"Как душит галстук..."
    "На улице было правда жарко."
    "Солнце грело мне обувь."
    "Они становились всё жарче и жарче."
    th"Так бы окунутся разок..."
    th"Разок..."
    dv"Ты чё там делаешь?"
    "Сзади послышался крик Алисы в мою сторону."
    sd"А...Я.."
    show dv laugh pioneer2 far with dissolve
    dv"Хочешь искупатся чтоли?"
    "Я решил разговаривать более серьёзно."
    th"Я же не зря кадрил медсестру."
    sd"Просто умыться пришёл."
    show dv smile pioneer2 far with dissolve
    dv"А..Ну раз умыться."
    if day_1_exit_door == 1:
        dv"Ты кстати хорошо с одеждой придумал..." #- путь открывается, если в первом дне выбрать *Выйти через дверь*
        th"Она откуда-то узнала, что это был я."
        th"Я был насторожен."
        dv"Просто в следующий раз, когда будешь бросать ключ, делай это тише."
    "Она начала приближатся к воде."
    sd"Только не мочить!"
    dv"Я тоже умыться хочу."
    dv"Или ты мне запрещаешь?"
    "На всякий случай, я отошёл от края воды."
    "И от Алисы."
    sd"Нет конечно."
    "Увидев, что я просёк её план по остужению меня, она просто присела возле края воды, взяла в руки воды и брызнула себе в лицо."
    "Возле блестящей воды, она смотрелась прекрасно..."
    th"Впринцепе она везде смотрится прекрасно."
    th"Но тут не чуть не хуже..."
    sd"Знаешь..Мне.."
    sd"Мне надо идти..."
    "Сказал я, заикаясь."
    show dv normal pioneer2 far with dspr
    dv"Иди, кто ж тебя держит."
    "Сказала она, заигранным голосом."
    sd"Да..."
    "Я поспешил удалится." 
    th"Как-нибудь вырулим."
    th"Надеюсь..."
    stop ambience
    jump Mods_Arseny_Danil_Vlad_Artem_day_2_7
label Mods_Arseny_Danil_Vlad_Artem_day_2_5:
    scene ext_aidpost_day
    #Если выбрать *Лодочная станция*:
    "Я решли провести время у лодочек."
    "Посидеть на пристани, подумать о жизни..."
    "Хотя..."
    "Просто подумать."  
    scene ext_boathouse_day with dissolve
    play ambience ambience_boat_station_day
    "Придя к лодочной станции, я присел на пристань..."
    th"Как и грозился..."
    "Уставился вдаль..."
    "Рассматрев бескрайнее море..Или это озеро?"
    "Я погрузился в себя..."
    show blink
    "Закрыл глаза..."
    "И..."
    "Просто начал мечтать..."
    th"Что если весь этот мир, это просто чья-то злая шутка?"
    th"Или просто чьё-то творение, созданное для забавы."
    th"А что если, сюда должен был попасть кто-то другой?"
    th"Или если этих миров много, и я нахожу в одном из сотен."
    th"А возможна ли ошибка в системе?"
    th"Что если сюда может попасть не один человек?"
    th"Возможно кто-то уже прощупал как это работает..."
    th"Может кто-то уже нашёл лазейку в этот мир и из него."
    th"И сейчас спокойно переходит по мирам достовляя себе удовольствие."
    "Под успокайвающий звук волнующееся воды, думалось легко и довольно спокойно."
    "Я не делал пауз, что бы задать себе вопрос. Как это обычно бывает."
    "Но заснуть так и не смог..."
    "Из-за палящего солнца прямо мне в глаза."
    th"Хотя мне этого явно делать не стоит."
    th"А то девочки могут опять что-нибудь со мной сделать."
    "Я специально не закрывался от солнца."
    sl"Данила, привет!"
    "Я испугался и открыл глаза."
    hide blink
    show unblink
    sd"А-А-А-А!"
    show sl smile2 swim with dissolve
    hide unblink
    "Я за малым не свалился в воду."
    sd"Предупреждай хотя бы."
    show sl shy swim with dspr
    sl"Прости..."
    "Взглянув на неё, я увидел что она была в купальнике..."
    th"На ней всё смотрится отлично..."
    show sl surprise swim with dspr
    sl"Данил?"
    "Она вернула меня в реальность."
    sl"Всё хорошо? Ты куда смотришь?"
    "Она обернулась"
    sl"Может со мной что-то не так?"
    "Она оглядела себя."
    sd"Не..Нет,нет ты что, всё отлично."
    sd"Просто я задумался."
    show sl smile2 swim with dspr
    sl"А..Ну тогда ладно."
    show sl sad swim with dspr
    sl"А ты чего здесь сидишь?"
    sl"Тебе разве не надо обходной подписать?"
    sd"Так он уже подписанный"
    "Ответил я."
    sl"Быстро ты..."
    sd"Да, вот щас до Ольги Дмитриевны пойду."
    show sl smile2 swim with dspr
    sl"Ну удачт тебе!"
    sd"И тебе не хворать!"
    "Я вышел с пристани и покинул лодочки."
    th"Как-нибудь вырулим."
    th"Надеюсь..."
    stop music
    jump Mods_Arseny_Danil_Vlad_Artem_day_2_7
label Mods_Arseny_Danil_Vlad_Artem_day_2_6:
    scene ext_aidpost_day
    #Eсли выбрать *Сцена*:
    "Пойду пожалуй на сцену."
    "Ведь именно это место ассоциируется с Алисой."
    scene ext_stage_normal_day with dissolve
    play music music_list["confession_oboe"] fadeout 3
    "Придя на сцену, я решил её обсмотреть"
    th"Всегда было интересно что было за кулисами."
    "При досканальном осмотре самой сцены и за её приделами, я ничего не обнаружил."
    th"Сцена как сцена..."
    th"Никакого реквизита, ничего."
    th"Ну хотя и правильно.."
    th"Вдруг дождь пойдёт."
    th"Да и зачем хранить, то что нужно, но то, чем не будут пользоватся."
    "Я был человек любопытный и даже умудрился заглянуть под сцену."
    "Там было темно, поэтому я ничего не разглядел."    
    "Я вылез из под сцены."
    sd"Ну, раз я уже всё обсмотрел..."
    "Я сел на лавочку, которая используется как трибуны."
    "И принялся ждать."
    "Заняв удобную мне позу, я от не чего делать начал фантазировать всё то, что первым придёт мне в голову."
    th"Главное долго не фантазировать, а то последним что придёт мне в голову - это солнечный удар."
    th"И так..."
    "Я глубоко вдохнул"
    stop music
    play music KinoBezdelnik fadeout 3
    "Закрыв глаза, у меня начала в голове играть музыка."
    #МУЗЫКА: https://ruo.morsmusic.org/track/120029
    "Кажется это была группа 'Кино'"
    "А песня..."
    "Не вспомню..."
    ss"Можете пропустить песню или послушать до конца."
    stop music fadeout 3
    play music music_list["confession_oboe"] fadeout 3
    # КОНЕЦ!!!
    "Слова песни явно на что-то намекали..." 
    sd"Вот песни тогда были..."
    th"Точнее сейчас..."
    th"Ну в общем суть понята."
    "Насладившись русским роком, я надумал всё таки идти к Ольге Дмитриевне."
    "Я встал с лавочки и пошёл вон."
    th"Как-нибудь вырулим."
    th"Надеюсь..."
    #Тут все выборы сходятся
label Mods_Arseny_Danil_Vlad_Artem_day_2_7:
    play music music_list["everyday_theme"] fadeout 3
    #Если выбрать *Пойти к Ольге Дмитриевне.*
    scene ext_square_day with dissolve
    "Проходя мимо памятника Генды я в очередной раз думал чем он так знаменит."
    "Людей на площади небыло совсем."
    "Я направился к домику вожатой."
    scene ext_house_of_mt_day with dissolve
    "Возле домика никого не было."
    th"Может внутри?"
    scene int_house_of_mt_day with dissolve
    "Я зашёл внутрь, но там также никого не оказалось..."
    th"Но сколько сейчас времени?"
    "Взглянув на часы, я увидел там 'До обеда ещё 10 минут!'"
    th"Может надо найти Ольгу Дмитриевну?"
    th"Вообще-то, она должна была ждать меня рядом с домиком."
    "Но её там не оказалось."
    th"Может подождать?"
    th"Она явно что-то заподозрит, когда я буду выходить из домика."
    "Мне показалось рациональной идеей если я просто подожду до обеда."
    "..."
    "Время выходить!"
    scene ext_house_of_mt_day with dissolve
    "Я оккуратно вышел из домика, опасаясь что кто-то меня увидит."
    "После чего отправился в столовую"
    play sound sfx_dinner_horn_processed
    scene ext_dining_hall_away_day with dissolve
    "Подходя к столовой, как раз прозвенел громкоговоритель."
    "Возле входа никого не было..."
    "Пока..."
    scene ext_dining_hall_near_day with dissolve
    "Столовая как на зло была закрыта..."
    "Это значило, что сюда сейчас сбегутся все и меня увидит вожатая..."
    th"Мда..."
    "Я быстро перепрыгнул через перила и спрятался за столовой, ожидая толпы пионеров."
    "Вообще я ждал пока они зайдут..."
    "Суть понята..."
    "Я сидя за столовой, слышал как кричала Ольга Дмитриевна."
    th"Конечно, когда такая толпа, как не кричать?"
    "Через минут 5 успокоения от вожатой, она всё таки впустила пионеров."
    th"Мой выход."
    "Я залез на крыльцо перепрыгнув через перила."
    stop music fadeout 5
    play ambience ambience_dining_hall_full fadeout 3
    scene int_dining_hall_people_day with dissolve
    "Зайдя внутрь, вожатую я не наблюдал."
    th"Может тоже ест?"
    "В любом случае это мне на руку."
    "Я чувствовал себя шпионом, которому надо пробратся куда-то и что-то украсть."
    "Свободный столик был возле Лены."
    th"Была не была!"
    show un normal pioneer with dissolve
    sd"Лена привет!"
    show un surprise pioneer with dspr
    un"Ой..."
    "Она покраснела."
    show un shocked pioneer with dspr
    un"А..Откуда ты моё имя знаешь?"
    "Она смотрела на меня ошарашенными глазами."
    th"Я же её в первый раз вижу..."
    show un sad pioneer with dspr
    sd"Я... Слышал где-то!"
    th"Я уже становлюсь мастером по <быстрому выдумыванию отговорок>"
    sd"Так что можно?"
    show un shy pioneer with dspr
    un"К...Конечно, с-садись."
    "Она говорила таким заикивающимся голосом."
    th"Стесняется наверное."
    show un smile2 pioneer with dspr
    un"А..Т-тебя Д-Данил зовут?"
    sd"Да, а откуда ты знаешь?"
    show un smile pioneer with dspr
    un"Слышала уже."
    "Она начанала говорить увереннее."
    hide un smile pioneer with dissolve
    "Я начал поедать свой обед."
    "Лена тем времен уже доела и ушла."
    "И я остался в одиночестве доедать свою порцию."
    "Главное есть быстро, пока не доела Ольга Дмитриевна."
    "..."
    "Удивительно, но за всё время своей трапезы, вожатую я так и не видел."
    th"Это хорошо!"
    "Доев, я оставил тарелку и направился к выходу."
    th"Теперь самое главное выйти незамеченным."
    "Оккуратно, не вызывая на себя внимания, я подошёл к выходу и..."
    scene ext_dining_hall_near_day with dissolve
    stop ambience fadeout 2
    play music music_list["eat_some_trouble"] fadeout 3
    "Вышел..."
    th"Я на свободе!"
    th"Теперь надо отправится на сцену."
    th"Там можно отсидеться."
    "Боясь навлечь на себя много лишнего внимания, я старался как можно оккуратней передвигатся."
    "Хотя..."
    th"Как можно оккуратно передвигатся?"
    "Поэтому я обычным шагом отправился к сцене."
    scene ext_stage_normal_day with dissolve
    "Подойдя к сцене меня встретила Алиса."
    "Встретить её тут не было большим сюрпризом."
    "Правда она шла ко мне навстречу"
    show dv surprise pioneer2 with dissolve
    dv"Ой... Привет."
    sd"Привет, ты чего тут?"
    show dv guilty pioneer2 with dspr
    dv"Да...Меня Ольга Дмитриевна позвала.."
    dv"Помочь ей."
    sd"Ну иди тогда, не буду задерживать."
    hide dv guilty pioneer2 with dissolve
    "Алиса поспешила удалится."
    "Ну а сцена была в моём распоряжении."
    "Подойдя к сцене я решил её осмотреть."
    th"Всегда было интересно на чем играют советские пионеры-музыканты."    
    th"Если здесь вообще такие есть..."
    th"Хотя, с чего им здесь не быть."
    th"Это в современном мире могут построить ГИГИНТСКУЮ сцену и не пользоватся ей годами."
    th"А в советское время такое отношение было не позволительно."
    "Я начал лазать по сцене."
    "..."
    "При досканальном осмотре самой сцены и за её приделами, я ничего не обнаружил."
    th"Сцена как сцена..."
    th"Никакого реквизита, ничего."
    th"Ну хотя и правильно.."
    th"Вдруг дождь пойдёт."
    th"Да и зачем хранить то что нужно на сцене? Хотя этим здесь всё равно никто не пользуются."
    th"Кроме Алисы."
    "Я был человек любопытный и даже умудрился заглянуть под сцену."
    "Там было темно, поэтому я ничего не разглядел."    
    "Я вылез из под сцены."    
    th"Мда..."
    th"Я думал будет интереснее."
    "Обессилевшись, я рухнул на лавочку которая выступала здесь как трибуны и закрыл глаза."
    show blink
    th"Ха..."
    th"Лавочки выступают..."
    "Мне показалось это смешным."
    "Ведь в моей голове был чёткий образ лавочек с гитарами и лавочки сидящие за барабанами."
    "У них были причёски 90-х"
    "Солнце слепило меня, поэтому я закрыл глаза."
    "Эти лавочки стояли на сцене перед тысячами фанатов и пели какую-то знакомую мелодию."
    stop music
    play music Zvezda
    #https://ruo.morsmusic.org/track/214w
    ss"Вы можете пропустить песню или дослушать до конца."
    #КАНЕЦ!!!
    stop music fadeout 3
    play music music_list["everyday_theme"] fadeout 3
    scene ext_stage_normal_sunset 
    show unblink
    sd"А лавочки то жгут..."
    hide blink
    "Открыв глаза, солнце уже садилось."
    th"ОБХОДНОЙ!"
    scene ext_houses_sunset with dissolve
    "Я вскочил с лавочки и побежал сначало к домику вожатой."
    "Бежал я со всех ног."
    "А то я что-то слишком долго обходной подписывал."
    "По пути к домику, я решил остановится чтобы восстановить дыхание."
    "А то если Ольга Дмитриевна увидит что я бежал, она подумает не ладное."
    scene ext_house_of_mt_sunset with dissolve
    "Подходя к домику Ольги Дмитриевны, я увидел что она сидела возле домика и читала книжку."
    th"Вон она..Сидит бездельничает."
    if is_hodil_brodil == 1:
        "Я в свою очередь думал о том достаточно ли долго тянул время." #- строка будет открыта если выбрать *Гулять*
    th"Ну, с богом."
    show mt normal pioneer far at right with dissolve
    "Подойдя в зону обнаружение вожатой"
    "Я протянул ей листок с подделаными подписями."
    show mt smile pioneer at center with dspr
    sd"Сделано!"
    "Она не читая обходной, сунула листок в карман"
    th"Есть!"
    th"Клюнула рыбка!"
    show mt surprise pioneer with dspr
    mt"Молодец! Ну как, познакомился с нашей медсестрой?"
    sd"Конечно!"
    "Я разговаривал очень уверенно."
    show mt normal pioneer with dspr
    mt"В какой кружок записался?"
    sd"Пока никуда.. Но думаю позже точно куда-нибудь запишусь!"
    show mt angry pioneer with dspr
    mt"Ну смотри! Скоро конец смены. Времени мало!"
    "Подметила она."
    mt"Ладно, пора уже и на ужин идти."
    show mt smile pioneer with dspr
    th"Наконец-то!"
    scene ext_square_sunset with dissolve
    "После этих слов, я вместе с вожатой направились к столовой."
    "Солнце уже садилось."
    th"Значит я слишком сильно тянул время..."
    scene ext_dining_hall_away_sunset with dspr
    "Когда мы подошли к столовой, на крыльце стояли несколько человек."
    "Электроник, Алиса"
    "Ульяна и Славя."
    "Подойдя ближе, я услышал о чём они болтали."
    stop music fadeout 3
    play music music_list["awakening_power"] fadeout 3
    show dv angry pioneer far with dissolve
    show el sad pioneer far at left with dspr:
        xcenter 0.3 ycenter 0.5
    dv"И больше не называй меня ДваЧе, а то ты у меня получишь!"
    show el upset pioneer far yt left with dspr:
        xcenter 0.3 ycenter 0.5
    el"Не называл я тебя так!"
    show dv rage pioneer far with dspr 
    us"Называл, Называл! Я всё слышала!"
    show us laugh pioneer far with dissolve:
        xcenter 0.1 ycenter 0.5
    el"Тебя даже там не было!"
    show el shocked pioneer far with dspr:
        xcenter 0.3 ycenter 0.5
    us"А вот и была. Я в кустах сидела."
    show us grin pioneer far with dspr:
        xcenter 0.1 ycenter 0.5
    sl"Хватит вам! Прекратите!"
    show sl serious pioneer far with dissolve:
        xcenter 0.7 ycenter 0.5
    th"Разговор был не на жизнь, а на смерть!"
    "Но тут в разговор вмешалась Ольга Дмитриевна."
    show el surprise pioneer far with dspr:
        xcenter 0.3 ycenter 0.5
    show dv angry pioneer far with dspr:
        xcenter 0.46 ycenter 0.5
    show sl surprise pioneer far with dspr:
        xcenter 0.65 ycenter 0.5
    show mt rage pioneer far with dspr:
        xcenter 0.84 ycenter 0.5
    mt"Что вы тут ругаетесь?"
    show sl angry pioneer far with dspr:
        xcenter 0.65 ycenter 0.5
    sl"Алиса Сыроежкину угрожает..."
    show dv rage pioneer far with dspr:
        xcenter 0.46 ycenter 0.5
    dv"Ничего я не угрожаю, а предупреждаю!"
    "Алиса была агрессивно настроена."
    show mt angry pioneer far with dspr:
        xcenter 0.84 ycenter 0.5
    mt"Ладно, успокоились и пошлите ужинать."
    stop music fadeout 3
label Mods_Arseny_Danil_Vlad_Artem_day_2_8:
    scene int_dining_hall_people_day with dissolve
    play music music_list["eat_some_trouble"] fadeout 3
    play ambience ambience_dining_hall_full fadeout 5
    "Все вместе мы вошли в столовую."
    "Кроме Слави."
    "Она куда-то удалилась никого не предупредив."
    "Я всё решил промолчать о её отсутствии и просто двинулся по направлению к запаху еды."
    show mi normal pioneer with dissolve
    "Запах привёл меня на место рядом с Мику."
    sd"Привет! Тут свободно?"
    show mi smile pioneer with dspr
    mi"Ой..Привет! Да конечно садись."
    sd"Спасибо!"
    "Не смотря на то что, это был первый раз встречи с Мику, она разговаривала со мной как обычно."
    show mi grin pioneer with dspr
    mi"Сегодня, смотри, гречка. Ты любишь гречку? И варёная курица! Я вообще курицу не люблю. Ну, то есть не то что не люблю..."
    "Она как обычно выпускала очереди слов из своего рта-пулемёта."
    show mi surprise pioneer with dspr
    mi"Ну если бы меня спросили, что бы мне больше всего хотелось, то бефстроганов или рагу... Нет, может быть просто котлету! Или ромштекс! Ты любишь ромштексы?"
    "Если бы я знал что это... Но звучит как мясо."
    sd"Я всеядный."
    show mi smile pioneer with dspr
    mi"Понятно. Но вот десерты, ты знаешь, мне здесь не очень нравятся. Я мороженое люблю! Ты любишь мороженое? Особенно пломбир <48 копеек>, но и <Ленинградское> тоже. Ой, прости, я всё о себе!"
    show mi normal pioneer with dspr
    mi"Может ты больше эскимо любишь?"
    "Я понимал только каждые три слова."
    th"Десерт, мороженое, любишь..."
    sd"Я всё мороженое люблю."
    "За несколько циклов я привык к ней."
    "И её тараторка мне уже казалась больше как какой-то рэп."
    "Пока я ел, краем глаза заметил как Славя вошла в столовую."
    "Она увидела меня, и сразу направилась к нашему столику."
    th"Может отчитывать будет?"
    th"Но что я такого сделал?"
    th"Может она просекла, что я прогуливал обходной?"
    hide mi normal pioneer with dspr
    show sl angry pioneer with dissolve
    sl"Данил!"
    "Я приготовился слушать отчёт в мою сторону."
    "Славя села рядом с Мику."
    show sl happy pioneer with dspr
    sl"Не поверишь, сегодня автобус приезжал."
    "Я поперхнулся."
    sd"Кх.Кх.."
    sd"А..Автобус?!?"
    th"ЧТО?"
    sd"ОН ЕЩЁ ТАМ?"
    show sl sad pioneer with dissolve
    sl"Не перебивай!"
    sl"Так вот..."
    "Она тянула, явно что-то скрывая."
    sl"С автобуса вышли два каких-то подозрительных пионера."
    "Я ПОПЕРХНУЛСЯ!!!"
    "Хотя было уже не чем."
    sd"Ч..Чего!?!"
    show sl smile2 pioneer with dissolve
    sl"Каких их зовут я так и не узнала."
    sl"Но они были напуганы..."
    sl"Я подумала ты что-то знаешь."
    sl"Ты же тоже опоздал на большую часть смены..."
    "Я слушал ВСЁ, о чём говорила Славя."
    "Не пропускал НИ ЕДИНОГО слова."
    "После чего перебил её."
    sd"Ты знаешь где они?"
    show sl happy pioneer with dissolve
    sl"Я направила их к домику Ольги Дмитриевны."
    "Я вскочил с места и побежал до домика вожатой!"
    "Славя кричала что-то вслед, но мне было крайне не до этого."
    stop music fadeout 3
    stop ambience fadeout 2
    scene ext_dining_hall_away_sunset with dissolve
    play music volnyuch fadeout 3
    "Выбежав..."
    "Нет.."
    "ВЫЛЕТЕВ из столовой, я со сверх скоростью побежал к домику вожатой."
     #Волнующая музыка
    # https://mp3party.net/music/10092217
    "В голове крутились мысли:"
    th"А что если они такие же как я?"
    th"Просто сели в автобус и оказались здесь."
    th"НО ИХ ДВОЕ?!?"
    th"Либо это везение, либо это ошибка системы."
    "Все вопросы я решил оставить им."
    th"На месте разберёмся."
    scene ext_house_of_mt_sunset with dissolve
    "Подбегая к домику уже виднелись какие-то не знакомые мне силуэты."
    "Искра надежды освежила меня."
    show ar siluet at cleft with dissolve 
    show vl siluet at cright with dissolve
    "Я подбежал к домику, возле которого стояли два..."
    "Человека?"
    "Они были одеты в новых, современных вещах."
    "Прям как я..."
    th"Прям как я."
    "Моей радости не было придела."
    "Но всё же я собрался с мыслями и начал диалог с пришельцами."
    sd"Привет пионеры!"
    show ar smile with dissolve
    "Они обернулись и показали свои лица..."
    bp"Здравствуй!"
    ap"Здравствуйте!"
    "Я еле-еле сдерживал слёзы."
    hide ext_house_of_mt_sunset with dissolve
      #Тёмный экран.
    th"Вот они..."
    th"Посланники..."
    th"Присланные сюда на помощь мне..."
    th"Либо они и есть мои ответы."
    th"Либо они помогут их найти."
    stop music fadeout 3
    scene ext_house_of_mt_sunset with dissolve
    play music music_list["eat_some_trouble"] fadeout 3
     #Конец волнующей музыке
     #Конец тёмного экрана
    "Я вздохнул."
    sd"Вы здесь первый раз?"
    th"Очевидно что - ДА!"
    "Но разговор надо было как-то продолжить."
    show vl nervous with dspr
    bp"Да, есть такое..."
    show ar surprised with dspr
    ap"Да."
    "Их ответы как и ожидалось были положительными."
    sd"А вы чего в жаркой одежде? Лето ведь!"
    "С насмешкой я задал им вопрос."
    show ar oops with dspr
    ap"Мы просто..."
    "Они явно не знали что ответить."
    show vl sad with dspr
    bp"Мы просто думали что здесь холодно."
    bp"Посмотрели погоду, а там передают минус 30"
    "Уверенно сказал мне доложил один из пришельцев."
    th"Видимо он ещё не знает куда попал."
    th"И не знает что словосочетание <Посмотрели погоду> здесь не естественно."
    sd"Вас как зовут?"
    show ar smile2 with dspr
    ap"Арсений!"
    sd"Приятно познакомиться, Данил."
    show ar maybe with dspr
    ar"Приятно."
    show bp shocked with dspr
    bp"Ты случаем не знаешь где вожатая?"
    "Выдал мне последний пришелец."
    "Видимо он хотел быстрее избежать разговора."
    th"Уже? Но мы ведь даже не успели познакомиться."
    th"А у нас ведь могло быть столько общего..."
    sd"Она..."
    "Растерялся я."
    sl"Здесь она."
    "Сзади от меня послышался голос Слави."
    "Испугавший меня своим внезапным вступлением."
    sd"А А А!"
    "Я испуганно оглянулся назад."
    show ar normal at left with dspr
    show vl sad at cleft with dspr
    show mt smile pioneer far at cright with dissolve
    show sl smile pioneer far at right with dissolve
    "Там как раз была Славя."
    "И Ольга Дмитриевна."
    mt"Здравствуйте пионеры!"
    vlar"Здравствуйте!"
    "Ответили они хором."
    show mt normal pioneer far at cright with dspr
    mt"Я вожатая этого лагеря."
    mt"Меня зовут Ольга Дмитриевна."
    mt"Пойдёмте, я дам вам пионерскую форму."
    hide mt normal pioneer with dspr
    hide ar normal with dspr
    hide vl sad with dspr
    "Они пошли в домик вожатой."
    show sl sad pioneer far with ds 
    sl"Они тебя обижали?"
    th"Меня?"
    th"Кто-то?"
    th"Обижать?"
    th"Да я после таскания сахара каждый цикл, сам кого хочешь обижу."
    sd"Нет, мы просто познакомились."
    sl"Ну ладно, мы там собираемся в карты играть..."
    show sl serious pioneer far with dspr
    "Славя была чем-то насторожена."
    "Рассержена..."
    "Растроена?"
    "В её голосе были нотки всего выше перечисленного."
    "Она им явно не доверяла."
    th"Но почему?"
    "В этом я был не полностью уверен."
    "Но она явно чем-то была не довольна."
    th"Она их только первый раз увидела."
    th"Может они ей как-то нагрубили?"
    "Все эти вопросы лезли в мою голову."
    "Ведь Славя не обижается на человека с первого взгляда."
    "Чтобы она обиделась надо постаратся."
    sl"Электроник игру придумал."
    sl"Сказал будет что-то типо турнира."
    sl"Пойдёшь?"
    th"Ну, делать мне сейчас всё равно нечего."
    sd"Да, конечно."
    sl"Супер, я сейчас за картами иду."
    "Славе стало лучше."
    "На её лице появилась улыбка."
    sl"Иди пока в столовую, там тебя все ждут."
    "Неожиданно."
    sd"Ладно, до встречи!"
    "Славя помахала мне рукой и пошла дальше."
    "..."
    "Через некоторое время, я уже стоял возле столовой."
    "На пути никого не виднелось."
    "Поэтому никто не сможет мне помешать спокойно дойти до столовой."
    "..."
    "Я вошёл в столовую и увидел толпу."
    "Во главе которой был Электроник."
    "Он видимо что-то рассказывал раз уж махает руками."
    "Я подошёл ближе."
    el"...а пока ждём пока Славя принесёт карты!"
    th"Блин!"
    th"Не успел."
    th"Ну он же будет повторять правила для опоздавших."
    th"Он же будет?"
    "Поживём - увидим."
    "Через некоторое время пришла Славя."
    "А за ней и вожатая."
    "И передала карты Электронику."
    el"Спасибо!"
    us"Когда начнём?"
    "Откуда-то крикнула Ульяна."
    el"Ещё не все собрались."
    "Про призы я решил не спрашивать."    
    us"А призы будут?"
    "Но Ульянка решила быстрее меня."
    "Тут уже она уже прыгает возле организатора."
    th"Быстрая бестия..."
    us"Призы! Призы!"    
    "Ульяна засыпала Электроника вопросами."
    us"А награды?"
    us"Может будут конфеты?"
    us"Барбарисы или шоколадные?"
    "И всё это она успела говорить во время того как ещё и прыгала возле Электроника."
    th"Ужас, что за дети пошли?"
    th"Были..."
    th"Гиперактивные какие-то."
    el"Ну... Я не знаю. Не от меня зависит."
    "Он обречённо развёл руками"
    "Ульяна надула губки ткнула Электроника в бок и в неизвестном направлении убежала из столовой со скоростью..."
    "Что-то возле скорости света."
    sd"А правила ты когда объяснишь?"
    el"Подожди, ещё Жени нету."
    "Ждать, что в этот раз отправят кого-то другого, я надеяться не стал."
    "Я устало вздохнул."
    sd"Ну, давай тогда я за ней схожу."
    el"Давай, она наверное где-то возле библеотеки."
    th"И без вас знаю где она."
    "Я покинул столовую."
    "И направился на площадь."
    "..."
    "Как и ожидалось Женя была там."
    sd"Ты чего сидишь? Пошли в карты играть, тебя там все ждут."
    mz"Не хочу."
    "Она отвернулась."
    mz"Не хочу и всё!"
    sd"Если ты не умеешь играть, то я тебе скажу что там НИКТО не умеет играть."
    "Я знал на что давить."
    sd"Поэтому Электроник расскажет правила, мы поиграем, по хохочем. В общем будет весело!"
    sd"Не переживай, просто поиграем и всё."
    sd"Или ты умеешь только то, о чём читала?"
    "Женя хихикнула."
    mz"Так что, все только меня ждут?"
    th"До неё долго доходит..."
    sd"Да."
    mz"Ну ладно, пошли."    
    "Через минуту мы были уже в столовой."
    "Все внимательно смотрели на Электроника."
    el"Итак!"
    "Тот начал объяснять правила его карточной игры."
    # Выбор:
    #*Пропустить*    *Прослушать*
   #Если выбрать *Прослушать*
    el"Каждый тур состоит из одной игры."
    el"В случае ничьей будет переигровка."
    el"После этого проигравший выбывает, и начинается следующий тур."
    el"Поскольку участников - восемь, то и туров будет три."
    "Я сел за столик с Леной."
    sd"Здравствуйте мадам."
    el"Посмотрите на карты."
    "Продолжил Электроник."
    el"У вас их ровно шесть"
    el"Теперь можете их открыть."
    el"Правила такие же как и в покере."
    el"Сначала идёт самая старшая карта, потом пара, потом две пары, потом тройка."
    el"Первым ходом вы выбираете карту, которую хотите забрать у противника."
    el"У него в свою очередь есть возможность карты местами два раза."
    el"Но можно и не менять, если собираются забрать не нужную карту."
    el"Но учтите - противник видит, какие карты вы меняете местами."
    el"Далее соперник забирает у вас карту."
    el"Всё понятно?"
    "Ну естественно ничего."
    "Но по ходу дела я уже набрался опыта и понял правила игры."
    el"Итак, можете начинать."
    sd"Не переживай, я тоже правила понял."
    th"Почему <тоже>?"
    "Ладно."
    # Начало игры, без тренировки.
    # Если проиграть Лене:
    "..."
    th"Ну правила я знаю."
    th"Играть умел."
    th"Но вот карты каждый раз разные..."
    "Опечаленный я покинул столовую."
    # Если выйграть Лену:
    th"Проще простого."
    th"Я профи в этой игре."
    "Лена встала из-за стола и вышла из столовой."
    "Следующим оппонентом была Ульяна."
    us"Поддаваться будешь?"
    sd"А ещё чего?"
    us"Да я тебя и так выйграю."
    sd"Щас и посмотрим."
    # Если проиграть Ульяне:
    th"ЧЁРТ!"
    "Проигрывать зазнайке всегда обидно."
    us"Я же говорила, что легко тебя обыграю!"
    "Она ткнула в меня пальцем и сделала её довольную, фирменную улыбку."
    sd"Тебя просто повезло!"
    us"Нет, я просто профессионал в этой игре."
    "Эту фразу говорил и я."
    "Несколько ходов назад."
    sd"Ну прощай тогда, профессионал."
    "Я с гордостью принял поражение и вышел прочь из столовой."
    # Если выйграть Ульяну:
    sd"Да!"
    us"Нет!"
    "Ульяна надула губки и скрестила руки, показывая всем своим видом, что не довольна поражением."
    us"Ты жульничал!"
    sd"Нет, это просто, я такой хороший игрок в Электроникову-игру."
    us"Ну вот и играй!"
    "Ульяна фыркнула и всем своим обиженным видом вышла из столовой."
    sd"Надо уметь принимать поражение!"
    "Крикнул я ей в след."
    "..."
    th"И так..."
    th"Финал."
    "Алиса была финалистом."
    "Она подсела ко мне за стол."
    dv"Добрался!"
    th"Добрался? Она меня за кого считает?!?"
    dv"Готов проиграть?"
    dv"Ну не переживай, добраться до финала - тоже большая заслуга."
    "Говорила она размеренно и уверенно."
    "Будто уже победила."
    sd"Меньше слов больше дела."
    "Нам раздали карты и мы начали игру."
    # Если проиграть Алисе:
    "Блин!"
    "Ну, зато дошёл до финала и проиграл не кому-нибудь, а Алисе."
    dv"Вот так это делается!"
    sd"Я просто тебе поддался."
    dv"Ну да, ну да."
    dv"Надо уметь принимать поражение."
    th"Да она меня дразнит!"
    dv"Цитата человека спереди от меня."
    th"Ах ты..."
    sd"Ну ладно, молодец."
    "Признал поражение я"
    dv"Вот так то лучше!"
    "Алиса улыбнулась."
    th"Её улыбка многого стоит."
    th"Особенно для меня."
    th"Так что проиграл я не зря."
    th"Я готов на всё, лишь бы вечность смотреть на её улыбку."
    dv"Ладно, я пошла."
    "Алиса прервала мои мысли о ней."
    sd"Пока!"
    "Я встал и доволен собой вышел из столовой."
    # Если выйграть Алису: *+1*
    sd"ДА! Я чемпион!"
    "Радостно воскрикнул я."
    sd"Вот так это делается!"
    dv"Вот и подавись своей победой."
    dv"Это всего лишь игра, не на корову же играли."
    "Пыталась она перебить мой дух победителя."
    sd"Любая победа - это победа."
    "Парировал я."
    "Этого хватило чтобы затушить её огонь."
    dv"Ну и сиди тогда здесь, победитель хренов."
    "Алиса недовольна вышла из столовой."
    th"Только эти двое не умеют принимать по-ра-же-ни-е"
    # Тут все выборы сходятся.
    "Выйдя из столовой, время было уже темно."
    "Не знаю сколько точно, но думаю надо бы пойти уже в домик Ольги Дмитриевны."
    "Она знала что я буду присутствовать на турнире, организатором которого будет Электроник."
    "Поэтому думаю она меня не поругает."
    "..."
    "Спустя время, я уже стоял возле домика вожатой."
    "Свет не горел, значит Ольга Дмитриевна уже спала."
    "Я оккуратно вошёл внутрь, лёг на кровать..."
    "Закрыл глаза..."
    "И спокойно заснул."
    "..."
    "Ночью меня посещали разные сны..."
    "Но один из них..."
    "..."
    # Тут будет музыка, которую я скину в дс под название *Horror-Music_day2*
    # Эффект помех
    "Ночь."
    "Туман."
    scene ext_aidpost_night
    "..."
    "Медпункт."
    "С виду он чем-то казался заброшенным"
    "Туман вокруг его навеевал тревогу."
    "Будто за ним кто-то есть."
    "Кто-то скрывается от взора моего."
    scene ext_old_building_night
    "..."
    "Старый корпус."
    "В окнах что-то виднелось."
    "Что-то..."
    "Напоминающее силуэт..."
    "Человека?"
    "Или что-то похожее на него."
    "Разглядеть то, что там было на самом деле..."
    "Я не успел."
    scene ext_camp_entrance_night
    "..."
    "Мнгновение и я уже стоял возле входа в лагерь."
    "По бокам от ворот, гордо стояли пионеры."
    "С виду, ничем не примечательные."
    "Много внимание я им не уделял."
    "Обернувшись..."
    scene ext_bus_night
    "Я увидел автобус."
    th"Икарус."
    th"Маршрут 410."
    "Двери были открыты."
    "Словно ждали меня."
    "Вели к нему."
    "Сон тянул меня внутрь автобуса."
    "..."
    scene int_bus_people_night
    "Внутри сидели обычные пионеры."
    "Такие как я."
    "В такой же одежде."
    bush"Данил..."
    "Не успев занять своё место..."
    "Меня кто-то окликнул."
    "Инстинктивно обернувшись..."
    # Моргание 1 раз
     #Эффект помех пропадает
    scene int_bus_night
    "Я никого не увидел."
    "Пройдя дальше по салону, я занял своё место."
    "И смирно ждал, пока автобус тронется."
    "..."
    voices"Данил..."
    "Я встал с места."
    sd"Да?"
    "Мой голос был хриплый."
    "Встав с места, я осмотрел автобус."
    # Моргание 1 раз
    scene int_bus_people_night
    voices"...мы тебя ждём..."
    "Я недоумевал."
    "Мои конечности были скованы."
    "Я остался стоять посреди автобуса, держась за соседние сиденья."
    "..."
    # Моргание 1 раз
    scene int_bus_night
    # Моргание 1 раз
    scene int_bus_black
    # Тряска экрана
    # Laughter1_day2 Laughter2_day2 Laughter3_day2 ОДНОВРЕМЕННО
    voices"...мы тебя ждём..."
    # LoudLaughter_day2    
    stop music 